Repository: VietThan/git-flight-rules
Catalog: README_*.po
Languages: vi

source: After you run the interactive rebase command, you will see something like this in your text editor:
vi: Sau khi bạn chạy lệnh interactive rebase, bạn sẽ thấy trông giống thế này trong trình soạn thảo (text editor) của bạn:

source: All the lines beginning with a `#` are comments, they won't affect your rebase.
vi: Tất cả các dòng bắt đầu bằng một `#` là các comment (chú thích), chúng sẽ không ảnh hưởng đến rebase của bạn.

source: Then you replace `pick` commands with any in the list above, and you can also remove commits by removing corresponding lines.
vi: Sau đó bạn thay thể lệnh `pick` với những bất cứ lệnh nào trong danh sách trên và bạn cũng có thể loại bỏ các commit khỏi rebase bằng cách xoá các dòng tương ứng.

source: For example, if you want to **leave the oldest (first) commit alone and combine all the following commits with the second oldest**, you should edit the letter next to each commit except the first and the second to say `f`:
vi: Ví dụ, nếu bạn muốnn **dữ nguyên commit cũ nhất(đầu tiên) và kết hợp tất cả commit sau với commit cũ thứ hai**, bạn nên chỉnh sửa chữ cái bên cạnh mỗi commit ngoại trừ chữ cái đầu tiên và chữ cái thứ hai với `f`:

source: If you want to combine these commits **and rename the commit**, you should additionally add an `r` next to the second commit or simply use `s` instead of `f`:
vi: Nếu bạn muốn kết hợp tất cả các commit **và đổi tên commit**, bạn nên thêm một chữ cái `r` bên cạnh commit thứ 2 hoặc đơn giản sử dụng `s` thay vì `f`:

source: You can then rename the commit in the next text prompt that pops up.
vi: Bạn có thể đổi tên commit trong đoạn hội thoại sẽ bật lên.

source: If everything is successful, you should see something like this:
vi: Nếu mọi thứ thành công, bạn sẽ thấy giống như thế này:

source: #### Safe merging strategy `--no-commit` performs the merge but pretends the merge failed and does not autocommit, giving the user a chance to inspect and further tweak the merge result before committing. `no-ff` maintains evidence that a feature branch once existed, keeping project history consistent.
vi: #### Chiến lược merge an toàn `--no-commit` thực hiện merge nhưng giả vờ kết hợp không thành công và không tự động tạo commit, cho phép người dùng có cơ hội kiểm tra và chỉnh thêm kết quả merge trước khi commit. `no-ff` duy trì bằng chứng rằng một nhánh tính năng đã từng tồn tại, giữ lịch sử dự án nhất quán.

source: #### I need to merge a branch into a single commit
vi: #### Tôi cần merge một nhánh thành một commit duy nhất

source: <a name="rebase-unpushed-commits"></a> #### I want to combine only unpushed commits
vi: <a name="rebase-unpushed-commits"></a> #### Tôi chỉ muốn kết hợp các commit chưa push

source: Sometimes you have several work in progress commits that you want to combine before you push them upstream. You don't want to accidentally combine any commits that have already been pushed upstream because someone else may have already made commits that reference them.
vi: Đôi khi bạn có một số commit trong khi công-việc-đang-tiến-hành và bạn muốn kết hợp thành một trước khi bạn đẩy lên upstream. Bạn không muốn vô tình kết hợp bất kỳ commit nào đã được push lên upstream vì người khác có thể đã thực hiện các commit tham chiếu chúng.

source: This will do an interactive rebase that lists only the commits that you haven't already pushed, so it will be safe to reorder/fix/squash anything in the list.
vi: Lệnh này sẽ thực hành một interactive rebase mà chỉ liệt kê các commit bạn chưa push, vì vậy mọi thứ sẽ an toàn để sắp xếp lại / sửa chữa / squash (gộp) bất cứ gì trong danh sách

source: #### I need to abort the merge
vi: #### Tôi cần huỷ bỏ merge

source: Sometimes the merge can produce problems in certain files, in those cases we can use the option `abort` to abort the current conflict resolution process, and try to reconstruct the pre-merge state.
vi: Đôi khi việc merge có thể gây ra sự cố trong một số file nhất định, trong những trường hợp đó, chúng ta có thể sử dụng cờ `abort` để hủy bỏ quá trình giải quyết xung đột hiện tại và cố gắng xây dựng lại trạng thái trước merge.

source: This command is available since Git version >= 1.7.4
vi: Lệnh này có sẵn từ phiên bản Git >= 1.7.4

source: ### I need to update the parent commit of my branch
vi: ### Tôi cần cập nhật commit gốc (parent commit) cho nhánh của tôi

source: Say I have a main branch, a feature-1 branch branched from main, and a feature-2 branch branched off of feature-1. If I make a commit to feature-1, then the parent commit of feature-2 is no longer accurate (it should be the head of feature-1, since we branched off of it). We can fix this with `git rebase --onto`.
vi: Giả sử tôi có một nhánh main, một nhánh feature-1 tách từ main và một nhánh feature-2 tách từ feature-1. Nếu tôi thực hiện commit đối với feature-1, thì commit của feature-2 không còn chính xác nữa (gốc nên là đầu của feature-1, vì chúng ta đã tách nhánh từ nó). Chúng ta có thể sửa vấn đề này với `git rebase --onto`.

source: ```sh (feature-2)$ git rebase --onto feature-1 <the first commit in your feature-2 branch that you don't want to bring along> feature-2 ```
vi: ```sh (feature-2)$ git rebase --onto feature-1 <commit đầu tiên trong nhánh feature-2 mà bạn không muốn mang theo> feature-2 ```

source: This helps in sticky scenarios where you might have a feature built on another feature that hasn't been merged yet, and a bugfix on the feature-1 branch needs to be reflected in your feature-2 branch.
vi: Lệnh này giúp trong các trường hợp khó nơi bạn có thể có một feature được xây dựng trên một feature khác chưa được merge, hoặc một bugfix (vá lỗi) trên nhánh feature-1 cần được phản ánh trong nhánh feature-2 của bạn.

source: ### Check if all commits on a branch are merged
vi: ### Kiểm tra xem tất cả commit trên một nhánh đã được merge

source: To check if all commits on a branch are merged into another branch, you should diff between the heads (or any commits) of those branches:
vi: Để kiểm tra tất cả commit trên một nhánh đã được merge vào nhánh khác, bạn nên diff (khác biệt) giữa các head (hoặc các commit) của các nhánh:

source: This will tell you if any commits are in one but not the other, and will give you a list of any nonshared between the branches. Another option is to do this:
vi: Lệnh này sẽ cho bạn biết nếu bất kỳ commit ở trong một nhánh nhưng không trong nhánh kia, và sẽ cung cấp cho bạn một danh sách của bất kỳ tệp không chia sẽ giữa các nhánh. Một lựa chọn khác là chạy lệnh:

source: ### Possible issues with interactive rebases
vi: ### Các vấn đề có thể xảy ra với interactive rebase

source: <a name="noop"></a> #### The rebase editing screen says 'noop'
vi: <a name="noop"></a> #### Màn hình chỉnh sửa rebase ghi 'noop'

source: If you're seeing this: ``` noop ```
vi: Nếu bạn thấy như sau: ``` noop ```

source: That means you are trying to rebase against a branch that is at an identical commit, or is *ahead* of your current branch. You can try:
vi: Điều này có nghĩa bạn đang cố rebase lại một nhánh đang có commit giống hệt hoặc là *ở trước* nhánh hiện tại. Bạn có thể thử:

source: making sure your main branch is where it should be
vi: đảm bảo nhánh main của bạn ở đúng chỗ

source: rebase against `HEAD~2` or earlier instead
vi: rebase với `HEAD~2` hoặc cũ hơn

source: <a name="merge-conflict"></a> #### There were conflicts
vi: <a name="merge-conflict"></a> #### Có một vài xung đột

source: If you are unable to successfully complete the rebase, you may have to resolve conflicts.
vi: Nếu bạn không thể hoàn tất thành công rebase, bạn có thể phải giải quyết xung đột.

source: First run `git status` to see which files have conflicts in them:
vi: Đầu tiên chạy `git status` để xem tệp nào có xung đột:

source: In this example, `README.md` has conflicts. Open that file and look for the following:
vi: Trong ví dụ đó, `README.md` có xung đột. Mở tệp đó và tìm những dòng trông như sau:

source: You will need to resolve the differences between the code that was added in your new commit (in the example, everything from the middle line to `new-commit`) and your `HEAD`.
vi: Bạn sẽ cần phải giải quyết sự khác biệt giữa code đã được thêm vào với commit mới của bạn (trong ví dụ, mọi thứ từ dòng ở giữa cho đến `new-commit`) và `HEAD` của bạn.

source: If you want to keep one branch's version of the code, you can use `--ours` or `--theirs`:
vi: Nếu bạn muốn giữ phiên bản code của một nhánh, bạn có thể sử dụng `--ours` hoặc `--theirs`:

source: - When *merging*, use `--ours` to keep changes from the local branch, or `--theirs` to keep changes from the other branch. - When *rebasing*, use `--theirs` to keep changes from the local branch, or `--ours` to keep changes from the other branch. For an explanation of this swap, see [this note in the Git documentation](https://git-scm.com/docs/git-rebase#git-rebase---merge).
vi: - Khi *đang merge*, sử dụng `--ours` để giữ các thay đổi từ nhánh local, hoặc `--theirs` để giữ các thay đổi từ nhánh khác. - Khi *đang rebase*, sử dụng `--theirs` để giữ các thay đổi từ nhánh local, hoặc `--ours` để giữ các thay đổi từ nhánh khác. Để hiểu giải thích về sự hoán đổi này, hãy xem [ghi chú này trong tài liệu Git](https://git-scm.com/docs/git-rebase#git-rebase---merge).

source: If the merges are more complicated, you can use a visual diff editor:
vi: Nếu việc merge phức tạp hơn, bạn có thể sử dụng trình chỉnh sửa khác biệt trực quan (visual diff editor):

source: After you have resolved all conflicts and tested your code, `git add` the files you have changed, and then continue the rebase with `git rebase --continue`
vi: Sau khi bạn đã giải quyết tất cả xung đột và đã kiểm tra code của mình, `git add` các file đã thay đổi và sau đó tiếp tục rebase với `git rebase --continue`

source: If after resolving all the conflicts you end up with an identical tree to what it was before the commit, you need to `git rebase --skip` instead.
vi: Nếu sau khi giải quyết tất cả các xung đột bạn kết thúc với một cây giống hệt với cái trước khi thực hiện, bạn cần `git rebase --skip`.

source: If at any time you want to stop the entire rebase and go back to the original state of your branch, you can do so:
vi: Nếu bất kỳ lúc nào bạn muốn dừng toàn bộ quá trình rebase và quay trở lại trạng thái ban đầu nhánh của bạn, bạn có thể làm như thế này:

source: <a name="stashing"></a> ## Stash
vi: <a name="stashing"></a> ## Stash (Cất)

source: ### Stash all edits
vi: ### Stash tất cả chỉnh sửa

source: To stash all the edits in your working directory
vi: Để stash tất cả các chỉnh sửa trong thư mục làm việc

source: If you also want to stash untracked files, use `-u` option.
vi: Nếu bạn cũng muốn stash các file chưa được theo dõi, sử dụng cờ `-u`.

source: ### Stash specific files
vi: ### Stash các file cụ thể

source: To stash only one file from your working directory
vi: Để stash chỉ một file từ thư mục làm việc

source: To stash multiple files from your working directory
vi: Để stash nhiều file từ thư mục làm việc

source: <a name="stash-msg"></a> ### Stash with message
vi: <a name="stash-msg"></a> ### Stash với message (thông điệp)

source: or
vi: hoặc

source: <a name="stash-apply-specific"></a> ### Apply a specific stash from list
vi: <a name="stash-apply-specific"></a> ### Apply một stash cụ thể từ danh sách

source: First check your list of stashes with message using
vi: Đầu tiên kiểm tra danh sách các stash với message bằng lệnh

source: Then apply a specific stash from the list using
vi: Sau đó apply (áp dụng) một stash cụ thể từ danh sách với

source: Here, 'n' indicates the position of the stash in the stack. The topmost stash will be position 0.
vi: Ở đây, 'n' cho biết vị trí của stash trong stack. Stash trên cùng sẽ là vị trí 0.

source: Furthermore, using a time-based stash reference is also possible.
vi: Hơn nữa, cũng có thể chỉ stash dựa vào mốc thời gian

source: <a name="stage-and-keep-unstaged"></a> ### Stash while keeping unstaged edits
vi: <a name="stage-and-keep-unstaged"></a> ### Stash trong khi giữ các thay đổi chưa stage

source: You can manually create a `stash commit`, and then use `git stash store`.
vi: Bạn có thể tạo một `stash commit`, rồi dùng lệnh `git stash store`.

source: ## Finding
vi: ## Finding (Tìm)

source: ### I want to find a string in any commit
vi: ### Tôi muốn tìm một chuỗi ký tự trong bất kỳ commit nào

source: To find a certain string which was introduced in any commit, you can use the following structure:
vi: Để tìm một chuỗi ký tự được giới thiệu với commit, bạn có thể sử dụng lệnh như sau:

source: ```sh $ git log -S "string to find" ```
vi: ```sh $ git log -S "chuỗi ký tự để tìm" ```

source: Commons parameters:
vi: Các cờ thường dùng:

source: `--source` means to show the ref name given on the command line by which each commit was reached.
vi: `--source` có nghĩa là hiển thị tên ref được đưa ra trên dòng lệnh mà mỗi lần commit đã đạt tới.

source: `--all` means to start from every branch.
vi: `--all` nghĩa là bắt đầu từ mọi nhánh.

source: `--reverse` prints in reverse order, it means that will show the first commit that made the change.
vi: `--reverse` in theo thứ tự ngược lại, có nghĩa là hiển thị commit đầu tiên đã thực hiện thay đổi.

source: <a name="i-want-to-find-by-author-committer"></a> ### I want to find by author/committer
vi: <a name="i-want-to-find-by-author-committer"></a> ### Tôi muốn tìm tác giả hoặc người commit

source: To find all commits by author/committer you can use:
vi: Để tìm tất cả commit từ tác giả hoặc người commit bạn có thể sử dụng:

source: ```sh $ git log --author=<name or email> $ git log --committer=<name or email> ```
vi: ```sh $ git log --author=<tên hoặc email> $ git log --committer=<tên hoặc email> ```

source: Keep in mind that author and committer are not the same. The `--author` is the person who originally wrote the code; on the other hand, the `--committer`, is the person who committed the code on behalf of the original author.
vi: Hãy nhớ rằng tác giả và người commit không giống nhau. `--author` là người ban đầu viết code; mặt khác, `--committer`, là người đã commit code thay mặt tác giả gốc.

source: ### I want to list commits containing specific files
vi: ### Tôi muốn liệt kê các commit chứa các file cụ thể

source: To find all commits containing a specific file you can use:
vi: Để tìm tất cả các commit chưa một file cụ thể bạn có thể sử dụng:

source: You would usually specify an exact path, but you may also use wild cards in the path and file name:
vi: Bạn thường sẽ chỉ định một đường dẫn (filepath) chính xác, nhưng bạn cũng có thể sử dụng các ký tự đại diện bất kỳ cho đường dẫn và tên tệp:

source: While using wildcards, it's useful to inform `--name-status` to see the list of committed files:
vi: Trong khi sử dụng ký tự đại diện bất kỳ, sẽ hữu ích hơn khi thêm `--name-status` để xem danh sách các tệp trong commit:

source: <a name="#i-want-to-view-the-commit-history-for-a-specific-function"></a> ### I want to view the commit history for a specific function
vi: <a name="#i-want-to-view-the-commit-history-for-a-specific-function"></a> ### Tôi muốn xem lịch sử commit của một function (chức năng) cụ thể

source: To trace the evolution of a single function you can use:
vi: Để truy tìm lịch sử tiến hóa của một function là dùng lệnh:

source: ```sh $ git log -L :FunctionName:FilePath ```
vi: ```sh $ git log -L :TênFunction:FilePath ```

source: Note that you can combine this with further `git log` options, like [revision ranges](https://git-scm.com/docs/gitrevisions) and [commit limits](https://git-scm.com/docs/git-log/#_commit_limiting).
vi: Ghi chú là bạn có thể xây dựng lệnh trên thêm với các cờ `git log` khác, giống như [phạm vi sửa đổi](https://git-scm.com/docs/gitrevisions) và [hạn mức commit](https://git-scm.com/docs/git-log/#_commit_limiting).

source: ### Find a tag where a commit is referenced
vi: ### Tìm một tag mà một commit đã tham chiếu

source: To find all tags containing a specific commit:
vi: Để tìm tất cả các tag có chứa một commit cụ thể

source: <a name="clone-submodules"></a> ### Clone all submodules
vi: <a name="clone-submodules"></a> ### Clone tất cả submodules

source: If already cloned:
vi: Nếu đã clone:

source: <a name="delete-submodule"></a> ### Remove a submodule
vi: <a name="delete-submodule"></a> ### Xoá một submodule

source: Creating a submodule is pretty straight-forward, but deleting them less so. The commands you need are:
vi: Tạo một submodule là khá rõ rành, nhưng xóa chúng ít không như vậy. Các lệnh bạn cần là:

source: ## Miscellaneous Objects
vi: ## Miscellaneous Objects (Những thứ khác)

source: ### Copy a folder or file from one branch to another
vi: ### Copy thư mục hoặc tệp file từ một nhánh sang nhánh khác

source: ```sh $ git checkout <branch-you-want-the-directory-from> -- <folder-name or file-name> ```
vi: ```sh $ git checkout <nhánh-có-tệp-bạn-muốn> -- <thư mục hoặc tên file> ```

source: ### Restore a deleted file
vi: ### Khôi phục một file đã bị xoá

source: First find the commit when the file last existed:
vi: Đầu tiên tìm commit cuối cùng ma file vẫn tồn tại:

source: Then checkout that file:
vi: Sau đó checkout file:

source: ``` git checkout deletingcommitid^ -- filename ```
vi: ``` git checkout id-của-commit-delete-trên^ -- filename ```

source: ### Delete tag
vi: ### Xoá tag

source: <a name="recover-tag"></a> ### Recover a deleted tag
vi: <a name="recover-tag"></a> ### Khôi phục một tag đã bị xoá

source: If you want to recover a tag that was already deleted, you can do so by following these steps: First, you need to find the unreachable tag:
vi: Nếu bạn muốn khôi phục tag đã bị xóa, bạn có thể làm được vậy với các bước sau: Trước tiên, bạn cần phải tìm tag không thể truy cập

source: Make a note of the tag's hash. Then, restore the deleted tag with following, making use of [`git update-ref`](https://git-scm.com/docs/git-update-ref):
vi: Ghi lại mã hash của tag. Sau đó, khôi phục tag đã xóa theo cách sử dụng [`git update-ref`](https://git-scm.com/docs/git-update-ref):

source: Your tag should now have been restored.
vi: Tag của bạn bây giờ đã được khôi phục.

source: ### Deleted Patch
vi: ### Patch (Vá) bị xóa

source: If someone has sent you a pull request on GitHub, but then deleted their original fork, you will be unable to clone their repository or to use `git am` as the [.diff, .patch](https://github.com/blog/967-github-secrets) URLs become unavailable. But you can checkout the PR itself using [GitHub's special refs](https://gist.github.com/piscisaureus/3342247). To fetch the content of PR#1 into a new branch called pr_1:
vi: Nếu ai đó đã gửi cho bạn một pull request trên GitHub, nhưng sau đó đã xoá chúng trên fork gốc, bạn sẽ không thể clone repository của họ hoặc sử dụng `git am` vì url của [.diff, .patch](https://github.com/blog/967-github-secrets) không dùng được. Nhưng bạn có thể checkout chính PR bằng cách sử dụng [GitHub's special refs](https://gist.github.com/piscisaureus/3342247). Để fetch nội dung của PR#1 vào một nhánh được gọi là pr_1, chạy:

source: ### Exporting a repository as a Zip file
vi: ### Xuất một repository ra một file Zip

source: ```sh $ git archive --format zip --output /full/path/to/zipfile.zip main ``` ### Push a branch and a tag that have the same name
vi: ```sh $ git archive --format zip --output /full/path/to/zipfile.zip main ``` ### Push một nhánh và một tag có tên giống nhau

source: If there is a tag on a remote repository that has the same name as a branch you will get the following error when trying to push that branch with a standard `$ git push <remote> <branch>` command.
vi: Nếu có một tag trên một remote repository mà có tên giống với một nhánh bạn sẽ gặp phải lỗi khi cố push nhanh với một lệnh `$ git push <remote> <branch>` bình thường.

source: Fix this by specifying you want to push the head reference.
vi: Sửa lỗi này bằng cách chỉ định bạn muốn đẩy tham chiếu của head.

source: If you want to push a tag to a remote repository that has the same name as a branch, you can use a similar command.
vi: Nếu bạn muốn đẩy một tag vào một repository tại remote có cùng tên với một nhánh, bạn có thể sử dụng một lệnh tương tự.

source: ## Tracking Files
vi: ## Tracking (Theo dõi) các file

source: <a href="i-want-to-change-a-file-names-capitalization-without-changing-the-contents-of-the-file"></a> ### I want to change a file name's capitalization, without changing the contents of the file
vi: <a href="i-want-to-change-a-file-names-capitalization-without-changing-the-contents-of-the-file"></a> ### Tôi muốn thay đổi cách viết hoa của tên tệp mà không thay đổi nội dung của tệp

source: ### I want to overwrite local files when doing a git pull
vi: ### Tôi muốn ghi đè lên các tệp local khi thực hiện lệnh git pull

source: <a href="remove-from-git"></a> ### I want to remove a file from Git but keep the file
vi: <a href="remove-from-git"></a> ### Tôi muốn xóa một tệp khỏi Git nhưng vẫn giữ tệp

source: ### I want to revert a file to a specific revision
vi: ### Tôi muốn đảo ngược tệp về bản sửa đổi cụ thể

source: Assuming the hash of the commit you want is c5f567:
vi: Giả sử mã hash của commit bạn muốn là c5f567:

source: ```sh (main)$ git checkout c5f567 -- file1/to/restore file2/to/restore ```
vi: ```sh (main)$ git checkout c5f567 -- fileSố1/Để/PhụcHồi fileSố2/Để/PhụcHồi ```

source: If you want to revert to changes made just 1 commit before c5f567, pass the commit hash as c5f567~1:
vi: Nếu bạn muốn đảo ngược các thay đổi được thực hiện chỉ 1 commit trước c5f567, đưa số hash commit như c5f567~1:

source: ### I want to list changes of a specific file between commits or branches
vi: ### Tôi muốn liệt kê các thay đổi của một tệp cụ thể giữa các commit hoặc các nhánh

source: Assuming you want to compare last commit with file from commit c5f567:
vi: Giả sử bạn muốn so sánh commit cuối cùng với tệp từ commit c5f567:

source: Same goes for branches:
vi: Cũng giống khi so sánh nhánh nhánh:

source: ### I want Git to ignore changes to a specific file
vi: ### Tôi muốn Git bỏ qua những thay đổi đối với một tệp cụ thể

source: This works great for config templates or other files that require locally adding credentials that shouldn't be committed.
vi: Các bước sau khá hợp cho các mẫu cấu hình hoặc các tệp yêu cầu thêm thông tin đăng nhập tại local mà không nên commit

source: Note that this does *not* remove the file from source control - it is only ignored locally. To undo this and tell Git to notice changes again, this clears the ignore flag:
vi: Lưu ý rằng điều này không xóa tệp khỏi kiểm soát source - nó chỉ bị bỏ qua tại local. Để hoán đổi thao tác này và yêu cầu Git lại chú ý các thay đổi, lệnh sau sẽ xóa cờ bỏ qua (ignore flag):

source: ## Debugging with Git
vi: ## Debugging (Gỡ lỗi) with Git

source: The [git-bisect](https://git-scm.com/docs/git-bisect) command uses a binary search to find which commit in your Git history introduced a bug.
vi: Lệnh [git-bisect](https://git-scm.com/docs/git-bisect) sử dụng tìm nhị phân để tìm commit đã giớ thiệu lỗi.

source: Suppose you're on the `main` branch, and you want to find the commit that broke some feature. You start bisect:
vi: Giả sử bạn đang ở nhánh `main` và bạn muốn tìm commit đã làm hỏng cái gì đó. Bạn bắt đầu bisect với:

source: Then you should specify which commit is bad, and which one is known to be good. Assuming that your *current* version is bad, and `v1.1.1` is good:
vi: Sau đó bạn đề rõ commit nào tồi và commit nào biết là tốt. Giả sử bạn biết phiên bản *hiện tại* là tồi, và `v1.1.1` là tốt:

source: Now `git-bisect` selects a commit in the middle of the range that you specified, checks it out, and asks you whether it's good or bad. You should see something like:
vi: Bây giờ `git-bisect` chọn commit ở giữa khoảng cách bạn lựa chọn, checkout cái commit đấy, và hỏi bạn là commit này tồi hay tốt. Bạn sẽ thấy giống như thế này:
