Repository: VietThan/git-flight-rules
Catalog: README_*.po
Languages: vi

source: When you want to get rid of all of your unstaged local uncommitted changes
vi: Khi bạn muốn loại bỏ tất cả các thay đổi chưa commit mà chưa stage tại local

source: ```sh $ git checkout . ``` <a href="i-want-to-discard-all-my-untracked-files"></a> ### I want to discard all of my untracked files
vi: ```sh $ git checkout . ``` <a href="i-want-to-discard-all-my-untracked-files"></a> ### Tôi muốn loại bỏ tất cả các file chưa được theo dõi (track)

source: When you want to get rid of all of your untracked files
vi: Khi bạn muốn loại bỏ tất cả các file chưa được theo dõi

source: <a href="I-want-to-unstage-specific-staged-file"></a> ### I want to unstage a specific staged file
vi: <a href="I-want-to-unstage-specific-staged-file"></a> ### Tôi muốn hạ khỏi stage một file cụ thể đã stage

source: Sometimes we have one or more files that accidentally ended up being staged, and these files have not been committed before. To unstage them:
vi: Đôi khi, chúng ta có một hoặc nhiều file đã vô tình lên stage và các file này chưa được commit trước đó. Để hạ chúng khỏi stage:

source: ```sh $ git reset -- <filename> ```
vi: ```sh $ git reset -- <TênFile> ```

source: This results in unstaging the file and make it look like it's untracked.
vi: Lệnh trên sẽ hạ file khỏi stage và làm nó không được theo dõi (untracked).

source: ## Branches
vi: ## Nhánh

source: ### I want to list all branches
vi: ### Tôi muốn liệt kê tất cả các nhánh

source: List local branches
vi: Liệt kê các nhanh tại local

source: List remote branches
vi: Liệt kê cách nhánh trên remote

source: List all branches (both local and remote)
vi: Liệt kê tất cả các nhánh (cả local và remote)

source: <a name="create-branch-from-commit"></a> ### Create a branch from a commit ```sh $ git checkout -b <branch> <SHA1_OF_COMMIT> ```
vi: <a name="create-branch-from-commit"></a> ### Tạo một nhánh mới từ một commit ```sh $ git checkout -b <nhánh> <SHA1_Của_COMMIT> ```

source: <a name="pull-wrong-branch"></a> ### I pulled from/into the wrong branch
vi: <a name="pull-wrong-branch"></a> ### Tôi đã pull (kéo) từ/vào sai nhánh

source: This is another chance to use `git reflog` to see where your HEAD pointed before the bad pull.
vi: Đây là một cơ hội khác để dùng `git reflog` để xem HEAD đã trỏ ở đâu trước khi pull sai.

source: ```sh (main)$ git reflog ab7555f HEAD@{0}: pull origin wrong-branch: Fast-forward c5bc55a HEAD@{1}: checkout: checkout message goes here ```
vi: ```sh (main)$ git reflog ab7555f HEAD@{0}: pull origin nhánh-sai: Fast-forward c5bc55a HEAD@{1}: checkout: checkout message goes here ```

source: Simply reset your branch back to the desired commit:
vi: Chỉ cần reset nhánh của bạn về commit mong muốn:

source: Done.
vi: Xong.

source: <a href="discard-local-commits"></a> ### I want to discard local commits so my branch is the same as one on the server
vi: <a href="discard-local-commits"></a> ### Tôi muốn loại bỏ các commit tại local để nhánh của tôi giống như nhánh trên server

source: Confirm that you haven't pushed your changes to the server.
vi: Kiểm tra rằng bạn chưa push các thay đổi của mình đến server.

source: `git status` should show how many commits you are ahead of origin:
vi: `git status` sẽ hiển thị số lượng các commit bạn có hơn origin:

source: One way of resetting to match origin (to have the same as what is on the remote) is to do this:
vi: Một cách để reset về origin (để có nhánh giống như trên remote) là chạy lệnh:

source: <a name="commit-wrong-branch"></a> ### I committed to main instead of a new branch
vi: <a name="commit-wrong-branch"></a> ### Tôi đã tạo commit lên main thay vì một nhánh mới

source: Create the new branch while remaining on main:
vi: Tạo nhánh mới trong khi giữ main:

source: Reset the branch main to the previous commit:
vi: Reset nhánh main đến commit trước đó:

source: `HEAD^` is short for `HEAD^1`. This stands for the first parent of `HEAD`, similarly `HEAD^2` stands for the second parent of the commit (merges can have 2 parents).
vi: `HEAD^` là viết tắt của `HEAD^1`. Đây là viết tắt của parent thứ nhất `HEAD`, tương tự `HEAD^2` là viết tắt của parent thứ hai của commit (merge có thể có 2 parent).

source: Note that `HEAD^2` is **not** the same as `HEAD~2` (see [this link](http://www.paulboxley.com/blog/2011/06/git-caret-and-tilde) for more information).
vi: Chú ý rằng `HEAD^2` **không** giống như `HEAD~2` (xem [link](http://www.paulboxley.com/blog/2011/06/git-caret-and-tilde) để thêm thông tin).

source: Alternatively, if you don't want to use `HEAD^`, find out what the commit hash you want to set your main branch to (`git log` should do the trick). Then reset to that hash. `git push` will make sure that this change is reflected on your remote.
vi: Ngoài ra, nếu bạn không muốn sử dụng `HEAD^`, tìm mã hash của commit mà bạn muốn main trỏ về(`git log` sẽ giúp bạn). Sau đó reset về mã hash đấy. `git push` sẽ đảm bảo rằng thay đổi này sẽ hiện trên remote của bạn.

source: For example, if the hash of the commit that your main branch is supposed to be at is `a13b85e`:
vi: Ví dụ, nếu hash của commit mà nhánh main của bạn đáng ra là `a13b85e`:

source: Checkout the new branch to continue working:
vi: Checkout một nhánh mới để tiếp tục làm việc:

source: <a name="keep-whole-file"></a> ### I want to keep the whole file from another ref-ish
vi: <a name="keep-whole-file"></a> ### Tôi muốn giữ toàn bộ file từ một ref-ish khác

source: Say you have a working spike (see note), with hundreds of changes. Everything is working. Now, you commit into another branch to save that work:
vi: Giả sử bạn có một cột mũi làm việc (xem Ghi Chú), với hàng trăm thay đổi. Mọi thứ đang hoạt động. Bây giờ, bạn commit vào một nhánh khác để lưu những thay đổi đó:

source: ```sh (solution)$ git add -A && git commit -m "Adding all changes from this spike into one big commit." ```
vi: ```sh (solution)$ git add -A && git commit -m "Cho tất cả các thay đổi trong cột mũi làm việc này vào một commit to." ```

source: When you want to put it into a branch (maybe feature, maybe `develop`), you're interested in keeping whole files. You want to split your big commit into smaller ones.
vi: Khi bạn muốn đặt nó vào một nhánh (có thể là feature, có thể `develop`), bạn quan tâm đến việc giữ toàn bộ các file. Bạn muốn chia commit lớn của bạn thành những cái nhỏ hơn.

source: Say you have:
vi: Giả sử bạn có:

source: branch `solution`, with the solution to your spike. One ahead of `develop`.
vi: nhánh `solution`, với giáp pháp bạn phát triển với cột mũi làm việc của bạn. Hơn `develop` một commit.

source: branch `develop`, where you want to add your changes.
vi: nhánh `develop`, nơi bạn muốn thêm các thay đổi của bạn.

source: You can solve it bringing the contents to your branch:
vi: Bạn có thể giải quyết bằng cách mang nội dung thay đổi sang nhánh của bạn:

source: This will get the contents of that file in branch `solution` to your branch `develop`:
vi: Lệnh trên sẽ lấy nội dung của tập tin đó trong nhánh `solution` đến nhánh `develop` của bạn:

source: Then, commit as usual.
vi: Sau đó, commit như bình thường.

source: Note: Spike solutions are made to analyze or solve the problem. These solutions are used for estimation and discarded once everyone gets clear visualization of the problem. ~ [Wikipedia](https://en.wikipedia.org/wiki/Extreme_programming_practices).
vi: Lưu ý: Cột mũi giải pháp được phát triển để phân tích hoặc giải quyết vấn đề. Các giải pháp này được sử dụng để ước tính và loại bỏ sau khi mọi người hiểu rõ vấn đề. ~ [Wikipedia](https://en.wikipedia.org/wiki/Extreme_programming_practices).

source: <a name="cherry-pick"></a> ### I made several commits on a single branch that should be on different branches
vi: <a name="cherry-pick"></a> ### Tôi đã thực hiện một số commit trên một nhánh mặc dù chúng nên ở các nhánh khác nhau

source: Say you are on your main branch. Running `git log`, you see you have made two commits:
vi: Giả sử bạn đang ở trên nhánh main của bạn. Chạy `git log`, bạn thấy bạn đã thực hiện 2 commit:

source: Let's take note of our commit hashes for each bug (`e3851e8` for #21, `5ea5173` for #14).
vi: Hãy lưu ý các hash commit của chúng ta cho mỗi bug (lỗi) (`e3851e8` cho #21, `5ea5173` cho #14).

source: First, let's reset our main branch to the correct commit (`a13b85e`):
vi: Trước tiên, hãy đặt lại nhánh main của chúng ta về commit chính xác (`a13b85e`):

source: Now, we can create a fresh branch for our bug #21:
vi: Bây giờ, chúng ta có thể tạo ra một nhánh mới cho lỗi #21 của chúng ta:

source: Now, let's *cherry-pick* the commit for bug #21 on top of our branch. That means we will be applying that commit, and only that commit, directly on top of whatever our head is at.
vi: Bây giờ, hãy *cherry-pick* commit cho bug #21 trên đầu của nhánh. Nói tóm lại là chúng ta sẽ áp commit đó, và chỉ commit đó, trực tiếp vào đầu của nhánh.

source: At this point, there is a possibility there might be conflicts. See the [**There were conflicts**](#merge-conflict) section in the [interactive rebasing section above](#interactive-rebase) for how to resolve conflicts.
vi: Tại thời điểm này, có khả năng có thể có xung đột hợp (merge conflicts). Hãy xem phần [**There were conflicts**](#merge-conflict) trong [phần interactive rebasing ở trên](#interactive-rebase) để làm thế nào giải quyết xung đột hợp.

source: Now let's create a new branch for bug #14, also based on main
vi: Bây giờ chúng ta hãy tạo một nhánh mới cho bug # 14, cũng dựa trên nhánh main:

source: And finally, let's cherry-pick the commit for bug #14:
vi: Và cuối cùng, hãy cherry-pick commit cho bug #14:

source: <a name="delete-stale-local-branches"></a> ### I want to delete local branches that were deleted upstream
vi: <a name="delete-stale-local-branches"></a> ### Tôi muốn xóa các nhánh local đã bị xóa tại luồng trước (upstream)

source: Once you merge a pull request on GitHub, it gives you the option to delete the merged branch in your fork. If you aren't planning to keep working on the branch, it's cleaner to delete the local copies of the branch so you don't end up cluttering up your working checkout with a lot of stale branches.
vi: Khi bạn kết hợp (merge) một pull request trên GitHub, nó sẽ cho bạn lựa chọn để xóa nhánh đã được kết hợp trong fork của bạn. Nếu bạn không có kế hoạch tiếp tục làm việc trên nhánh đấy, mọi thứ sẽ sạch hơn nếu xóa các bản sao local của nhánh, do đó bạn không tồn đọng một cách lộn xộn tại bản sao làm việc của bạn với các nhánh cũ.

source: where, `upstream` is the remote you want to fetch from.
vi: upstream` là remote bạn muốn fetch (gọi) về.

source: <a name='restore-a-deleted-branch'></a> ### I accidentally deleted my branch
vi: <a name='restore-a-deleted-branch'></a> ### Tôi vô tình xóa nhánh của tôi

source: If you're regularly pushing to remote, you should be safe most of the time. But still sometimes you may end up deleting your branches. Let's say we create a branch and create a new file:
vi: Nếu bạn thường xuyên push lên remote, bạn sẽ an toàn phần lớn thời gian. Nhưng đôi khi bạn có thể sẽ xóa các nhánh của bạn. Giả sử chúng ta tạo một nhánh và tạo một tệp mới:

source: Let's add it and commit.
vi: Hãy thêm nó và rồi tạo commit.

source: Now we're switching back to main and 'accidentally' removing our branch.
vi: Bây giờ chúng ta chuyển lại về main và 'vô tình' xóa nhánh của chúng ta

source: ```sh (my-branch)$ git checkout main Switched to branch 'main' Your branch is up-to-date with 'origin/main'. (main)$ git branch -D my-branch Deleted branch my-branch (was 4e3cd85). (main)$ echo oh noes, deleted my branch! oh noes, deleted my branch! ```
vi: ```sh (my-branch)$ git checkout main Switched to branch 'main' Your branch is up-to-date with 'origin/main'. (main)$ git branch -D my-branch Deleted branch my-branch (was 4e3cd85). (main)$ echo ôi không,tôi delete nhánh tôi! ôi không,tôi delete nhánh tôi! ```

source: At this point you should get familiar with 'reflog', an upgraded logger. It stores the history of all the action in the repo.
vi: Tại thời điểm này, bạn nên làm quen với 'reflog', một logger (ký sử) được nâng cấp. Nó lưu trữ lịch sử của tất cả các hành động trong repo.

source: As you can see we have commit hash from our deleted branch. Let's see if we can restore our deleted branch.
vi: Như bạn có thể thấy chúng ta có số hash của commit từ nhánh đã xóa của chúng ta. Hãy xem liệu chúng ta có thể khôi phục nhánh đã xóa của chúng ta hay không.

source: Voila! We got our removed file back. `git reflog` is also useful when rebasing goes terribly wrong.
vi: Và đấy! Chúng ta đã phục hồi lại được file bị xóa của chúng ta. `git reflog` cũng hữu ích khi rebase tạo sai lầm lớn.

source: ### I want to delete a branch
vi: ### Tôi muốn xoá một nhánh

source: To delete a remote branch:
vi: Để xoá một nhánh tại remote:

source: You can also do:
vi: Bạn cũng có thể chạy :

source: To delete a local branch:
vi: Để xoá nhánh tại local:

source: To delete a local branch that *has not* been merged to the current branch or an upstream:
vi: Để xoá một nhánh local *chưa được* merge với nhánh hiện tại hoặc trên upstream (luồng trước):

source: ### I want to delete multiple branches
vi: ### Tôi muốn xoá nhiều nhánh

source: Say you want to delete all branches that start with `fix/`:
vi: Giả sử bạn muốn xoá tất cả các nhánh bắt đầu với `fix/`:

source: ### I want to rename a branch
vi: ### Tôi muốn đổi tên một nhánh

source: To rename the current (local) branch:
vi: Để đổi tên nhánh local hiện tại:

source: ```sh (main)$ git branch -m new-name ```
vi: ```sh (main)$ git branch -m tên-mới ```

source: To rename a different (local) branch:
vi: Để đổi tên nhánh local khác:

source: ```sh (main)$ git branch -m old-name new-name ```
vi: ```sh (main)$ git branch -m tên-cũ tên-mới ```

source: To delete the `old-name` remote branch and push the `new-name` local branch:
vi: Để vừa xóa nhánh `tên-cũ` tại remote và push nhánh `tên-mới` từ local:

source: ```sh (main)$ git push origin :old_name new_name ```
vi: ```sh (main)$ git push origin :tên_cũ tên_mới ```

source: <a name="i-want-to-checkout-to-a-remote-branch-that-someone-else-is-working-on"></a> ### I want to checkout to a remote branch that someone else is working on
vi: <a name="i-want-to-checkout-to-a-remote-branch-that-someone-else-is-working-on"></a> ### Tôi muốn checkout đến một nhánh remote mà người khác đang làm việc trên đó

source: First, fetch all branches from remote:
vi: Đầu tiên, fetch tất cả nhánh từ remote:

source: Say you want to checkout to `daves` from the remote.
vi: Giả sử bạn muốn checkout sang `daves` từ remote.

source: (`--track` is shorthand for `git checkout -b [branch] [remotename]/[branch]`)
vi: (`--track` là viết tắt của `git checkout -b [branch] [remotename]/[branch]`)

source: This will give you a local copy of the branch `daves`, and any update that has been pushed will also show up remotely.
vi: Lệnh này sẽ cung cấp cho bạn một bản sao tại local của nhánh `daves` và mọi cập nhật đã được push cũng sẽ được hiển thị từ remote.

source: ### I want to create a new remote branch from current local one
vi: ### Tôi muốn tạo một nhánh remote mới từ một nhánh local hiện tại

source: If you would also like to set that remote branch as upstream for the current one, use the following instead:
vi: Nếu bạn cũng muốn đặt nhánh remote là upstream cho nhánh hiện tại, sử dụng:

source: With the `upstream` mode and the `simple` (default in Git 2.0) mode of the `push.default` config, the following command will push the current branch with regards to the remote branch that has been registered previously with `-u`:
vi: Với chế độ `upstream` và `simple` (mặc định trong Git 2.0) của cấu hình `push.default`, lệnh sau sẽ push nhánh hiện tại lên nhánh remote được đăng ký trước đó với `-u`:

source: The behavior of the other modes of `git push` is described in the [doc of `push.default`](https://git-scm.com/docs/git-config#git-config-pushdefault).
vi: Các hành vi của các chế độ khác của `git push` được mô tả trong [doc cho `push.default`](https://git-scm.com/docs/git-config#git-config-pushdefault).

source: ### I want to set a remote branch as the upstream for a local branch
vi: ### Tôi muốn thiết lập một nhánh remote làm upstream (luồng trước) cho một nhánh local

source: You can set a remote branch as the upstream for the current local branch using:
vi: Bạn có thể thiết lập một nhánh remote làm upstream cho nhánh local hiện tại bằng cách chạy lệnh:

source: ```sh $ git branch --set-upstream-to [remotename]/[branch] # or, using the shorthand: $ git branch -u [remotename]/[branch] ```
vi: ```sh $ git branch --set-upstream-to [remotename]/[branch] # hoặc, dùng ký tắt: $ git branch -u [remotename]/[branch] ```

source: To set the upstream remote branch for another local branch:
vi: Để thiết lập nhánh upstream remote cho nhánh local khác:

source: <a name="i-want-to-set-my-HEAD-to-track-the-default-remote-branch"></a> ### I want to set my HEAD to track the default remote branch
vi: <a name="i-want-to-set-my-HEAD-to-track-the-default-remote-branch"></a> ### Tôi muốn để HEAD của tôi dõi theo nhánh mặc định của remote

source: By checking your remote branches, you can see which remote branch your HEAD is tracking. In some cases, this is not the desired branch.
vi: Bằng cách kiểm tra các nhánh remote của bạn, bạn có thể thấy nhánh remote nào mà HEAD của bạn đang theo dõi. Trong một số trường hợp, có thể đấy không phải là nhánh mong muốn.

source: To change `origin/HEAD` to track `origin/main`, you can run this command:
vi: Để thay đổi `origin/HEAD` sang theo dõi `origin/main`, bạn có thể chạy lệnh này:

source: ### I made changes on the wrong branch
vi: ### Tôi đã thực hiện thay đổi trên sai nhánh

source: You've made uncommitted changes and realise you're on the wrong branch. Stash changes and apply them to the branch you want:
vi: Bạn đã thực hiện các thay đổi chưa được commit và nhận ra bạn đang ở sai nhánh. Stash (cất) các thay đổi và apply (áp dụng) chúng vào nhánh bạn muốn:

source: ```sh (wrong_branch)$ git stash (wrong_branch)$ git checkout <correct_branch> (correct_branch)$ git stash apply ```
vi: ```sh (wrong_branch)$ git stash (wrong_branch)$ git checkout nhánh_đúng (correct_branch)$ git stash apply ```

source: <a name="i-want-to-split-a-branch-into-two"></a> ### I want to split a branch into two
vi: <a name="i-want-to-split-a-branch-into-two"></a> ### Tôi muốn tách một nhánh thành hai

source: You've made a lot of commits on a branch and now want to separate it into two, ending with a branch up to an earlier commit and another with all the changes.
vi: Bạn đã tạo rất nhiều commit trên một nhành và bây giờ bạn muốn tách nhánh ra thành hai, một nhánh kết thúc với một commit cũ, và một nhánh với tất cả các thay đổi.

source: Use `git log` to find the commit where you want to split. Then do the following:
vi: Dùng `git log` để tìm commit bạn muốn làm mốc để tách. Sau đó chạy lệnh như sau:

source: ```sh (original_branch)$ git checkout -b new_branch (new_branch)$ git checkout original_branch (original_branch)$ git reset --hard <sha1 split here> ```
vi: ```sh (original_branch)$ git checkout -b new_branch (new_branch)$ git checkout original_branch (original_branch)$ git reset --hard <số sha1 commit để tách> ```

source: If you had previously pushed the `original_branch` to remote, you will need to do a force push. For more information check [Stack Overlflow](https://stackoverflow.com/questions/28983458/how-to-split-a-branch-in-two-with-git/28983843#28983843)
vi: Nếu bạn trước đó đã push nhánh gốc lên remote, bạn sẽ cần phải push ép (force push). Để thêm thông tin xem [Stack Overlflow](https://stackoverflow.com/questions/28983458/how-to-split-a-branch-in-two-with-git/28983843#28983843).

source: ## Rebasing and Merging
vi: ## Rebasing và Merging

source: <a name="undo-rebase"></a> ### I want to undo rebase/merge
vi: <a name="undo-rebase"></a> ### Tôi muốn đảo ngược rebase/merge

source: You may have merged or rebased your current branch with a wrong branch, or you can't figure it out or finish the rebase/merge process. Git saves the original HEAD pointer in a variable called ORIG_HEAD before doing dangerous operations, so it is simple to recover your branch at the state before the rebase/merge.
vi: Bạn có thể đã merge hoặc rebase nhánh hiện tại của bạn với một nhánh sai hoặc bạn không thể tìm ra cách hoàn thành quá trình rebase/merge. Git lưu con trỏ original HEAD trong một variable (biến) được gọi là ORIG_HEAD trước khi chạy các hành động nguy hiểm, vì vậy bạn có thể dễ dàng khôi phục lại trạng thái trước khi rebase/merge.

source: <a name="force-push-rebase"></a> ### I rebased, but I don't want to force push
vi: <a name="force-push-rebase"></a> ### Tôi đã rebase, nhưng tôi không muốn push ép (force push)

source: Unfortunately, you have to force push, if you want those changes to be reflected on the remote branch. This is because you have changed the history. The remote branch won't accept changes unless you force push. This is one of the main reasons many people use a merge workflow, instead of a rebasing workflow - large teams can get into trouble with developers force pushing. Use this with caution. A safer way to use rebase is not to reflect your changes on the remote branch at all, and instead to do the following:
vi: Thật không may, bạn bắt buộc phải push ép, nếu bạn muốn những thay đổi đó được phản ánh trên nhánh remote. Điều này là do bạn đã thay đổi lịch sử. Nhánh remote sẽ không chấp nhận thay đổi trừ khi bạn push ép. Đây là một trong những lý do chính khiến nhiều người sử dụng quy trình làm việc trên merge, thay vì quy trình làm việc trên rebasing - các nhóm lớn có thể gặp rắc rối khi developer push ép. Nên sử dụng rebase một cách thận trọng. Một cách an toàn hơn để sử dụng rebase không là không phản ánh các thay đổi của bạn trên nhánh remote và thay vào đó thực hiện các thao tác sau:

source: For more, see [this SO thread](https://stackoverflow.com/questions/11058312/how-can-i-use-git-rebase-without-requiring-a-forced-push).
vi: Để biết thêm hãy xem [chủ đề này trên SO](https://stackoverflow.com/questions/11058312/how-can-i-use-git-rebase-without-requiring-a-forced-push).

source: <a name="interactive-rebase"></a> ### I need to combine commits
vi: <a name="interactive-rebase"></a> ### Tôi cần kết hợp các commit

source: Let's suppose you are working in a branch that is/will become a pull-request against `main`. In the simplest case when all you want to do is to combine *all* commits into a single one and you don't care about commit timestamps, you can reset and recommit. Make sure the main branch is up to date and all your changes committed, then:
vi: Giả sử bạn đang làm việc trong một nhánh có / sẽ trở thành một pull-request cho `main`. Trong trường hợp đơn giản nhất khi bạn chỉ muốn là kết hợp *tất cả* các commit thành một commit và bạn không quan tâm đến timestamp (mốc thời gian) của commit, bạn có thể reset và commit lại. Đảm bảo rằng nhánh main được cập nhật và tất cả các thay đổi của bạn được commit, sau đó:

source: If you want more control, and also to preserve timestamps, you need to do something called an interactive rebase:
vi: Nếu bạn muốn kiểm soát được nhiều hơn và cũng để bảo vệ timestamp, bạn cần phải làm một vài thứ được gọi là interactive rebase:

source: If you aren't working against another branch you'll have to rebase relative to your `HEAD`. If you want to squash the last 2 commits, for example, you'll have to rebase against `HEAD~2`. For the last 3, `HEAD~3`, etc.
vi: Nếu bạn không làm việc với một nhánh khác, bạn phải rebase tương đối so với `HEAD` của bạn. Nếu bạn muốn gộp 2 commit cuối, bạn sẽ phải rebase tới `HEAD~2`. Cho 3 commit cuối, `HEAD~3`,...
