Repository: VietThan/git-flight-rules
Catalog: README_*.po
Languages: vi

source: If you edit the file and remove the sensitive data, then run ```sh (feature-branch)$ git add edited_file (feature-branch)$ git commit --amend --no-edit (feature-branch)$ git push --force-with-lease origin [branch] ```
vi: Nếu bạn đã chỉnh sửa tệp và xóa dữ liệu nhạy cảm, hãy chạy ```sh (feature-branch)$ git add EditedFile (feature-branch)$ git commit --amend --no-edit (feature-branch)$ git push --force-with-lease origin [branch] ```

source: If you want to remove an entire file (but keep it locally), then run ```sh (feature-branch)$ git rm --cached sensitive_file echo sensitive_file >> .gitignore (feature-branch)$ git add .gitignore (feature-branch)$ git commit --amend --no-edit (feature-branch)$ git push --force-with-lease origin [branch] ``` Alternatively store your sensitive data in local environment variables.
vi: Nếu bạn muốn xóa toàn bộ tệp (nhưng giữ trên local), hãy chạy: ```sh (feature-branch)$ git rm --cached sensitive_file echo sensitive_file >> .gitignore (feature-branch)$ git add .gitignore (feature-branch)$ git commit --amend --no-edit (feature-branch)$ git push --force-with-lease origin [branch] ``` Ngoài ra, lưu trữ dữ liệu nhạy cảm của bạn trong các biến môi trường (variable) của local.

source: If you want to completely remove an entire file (and not keep it locally), then run
vi: Nếu bạn muốn xóa hoàn toàn toàn bộ tệp (và không giữ tệp tại local), hãy chạy

source: If you have made other commits in the meantime (i.e. the sensitive data is in a commit before the previous commit), you will have to rebase.
vi: Nếu bạn đã thực hiện các commit khác (tức là dữ liệu nhạy cảm nằm tại commit trước commit mới nhất), bạn sẽ phải rebase.

source: <a href="#i-want-to-remove-a-large-file-from-ever-existing-in-repo-history"></a> ### I want to remove a large file from ever existing in repo history
vi: <a href="#i-want-to-remove-a-large-file-from-ever-existing-in-repo-history"></a> ### Tôi muốn xóa file to quá để chưa bao giờ xuất hiện trong lịch sử repository

source: If the file you want to delete is secret or sensitive, instead see [how to remove sensitive files](#i-accidentally-committed-and-pushed-files-containing-sensitive-data).
vi: Nếu file bạn muốn xóa cần bảo mật hay là file chưa thông tin nhạy cảm, xem phần [xóa file chứa thông tin nhạy cảm](#undo-sensitive-commit-push).

source: Even if you delete a large or unwanted file in a recent commit, it still exists in git history, in your repo's `.git` folder, and will make `git clone` download unneeded files.
vi: Mặc dù bạn đã xóa một file to hay file không muốn có trong dự án, nó có thể vẫn tồn tại trong lịch sử git (git history) của respository trong thư mục `.git`, và sẽ khiến các lệnh `git clone` tải file không cần thiết.

source: The actions in this part of the guide will require a force push, and rewrite large sections of repo history, so if you are working with remote collaborators, check first that any local work of theirs is pushed.
vi: Những bước trong phần này sẽ yêu cầu push ép, và viết lại phần nào lịch sử git của repository, thế nên nếu bạn làm việc với những người khác, kiểm tra là những thay đổi của họ đã được đẩy.

source: There are two options for rewriting history, the built-in `git-filter-branch` or [`bfg-repo-cleaner`](https://rtyley.github.io/bfg-repo-cleaner/). `bfg` is significantly cleaner and more performant, but it is a third-party download and requires java. We will describe both alternatives. The final step is to force push your changes, which requires special consideration on top of a regular force push, given that a great deal of repo history will have been permanently changed.
vi: Có hai lựa chọn để viết lại lịch sử, sử dụng tính năng sãn có `git-filter-branch` hoặc dùng [`bfg-repo-cleaner`](https://rtyley.github.io/bfg-repo-cleaner/). `bfg` thao tác sạch hơn và nhanh hơn, nhưng đây là phần mềm bên thứ ba và cần có Java. Chúng ta sẽ xem cả hai cách. Bước cuối cùng là push ép thay đổi của bạn, lần này sẽ còn cần chú ý xem xét hơn các push ép bình thường bởi vì một phần không nhỏ lịch sử repository sẽ thay đổi vĩnh viễn.

source: #### Recommended Technique: Use third-party bfg
vi: #### Cách khuyến khích: Sử dụng dịch vụ bên thứ ba bfg

source: Using bfg-repo-cleaner requires java. Download the bfg jar from the link [here](https://rtyley.github.io/bfg-repo-cleaner/). Our examples will use `bfg.jar`, but your download may have a version number, e.g. `bfg-1.13.0.jar`.
vi: Sử dụng bfg-repo-cleaner cần có Java. Tải file dạng .jar cho phần mềm bfg với đường link [này](https://rtyley.github.io/bfg-repo-cleaner/). Ví dụ tại đây sẽ dùng `bfg.jar`, nhưng file bạn tải xuống có thể có thêm số phiên bản như `bfg-1.13.0.jar`.

source: To delete a specific file.
vi: Để xóa một file, dùng lệnh:

source: Note that in bfg you must use the plain file name even if it is in a subdirectory.
vi: Lưu ý là với bfg bạn dùng tển của file chứ không phải đường dẫn đến file.

source: You can also delete a file by pattern, e.g.:
vi: Bạn cũng có thể xóa file dượng theo một khuôn mẫu, ví dụ xóa tất cả file dạng .jpg:

source: With bfg, the files that exist on your latest commit will not be affected. For example, if you had several large .tga files in your repo, and then in an earlier commit, you deleted a subset of them, this call does not touch files present in the latest commit
vi: Với bfg, the files that exist on your latest commit will not be affected. For example, if you had several large .tga files in your repo, and then in an earlier commit, you deleted a subset of them, this call does not touch files present in the latest commit

source: Note, if you renamed a file as part of a commit, e.g. if it started as `LargeFileFirstName.mp4` and a commit changed it to `LargeFileSecondName.mp4`, running `java -jar ~/Downloads/bfg.jar --delete-files LargeFileSecondName.mp4` will not remove it from git history. Either run the `--delete-files` command with both filenames, or with a matching pattern.
vi: Lưu ý, nếu bạn thay đổi tên file trong một commit trước, ví dụ: nếu tệp bắt đầu với tên `LargeFileFirstName.mp4` và một commit đổi tên tệp thành `LargeFileSecondName.mp4`, chạy lệnh `java -jar ~/Downloads/bfg.jar --delete-files LargeFileSecondName.mp4` sé không xóa file trong lịch sử git. Hoặc là chạy lệnh `--delete-files` với cả hai tên, hoặc với khuôn mẫu như trên.

source: #### Built-in Technique: Use git-filter-branch
vi: #### Cách có sẵn: Sử dụng git-filter-branch

source: `git-filter-branch` is more cumbersome and has less features, but you may use it if you cannot install or run `bfg`.
vi: `git-filter-branch` nặng hơn và ít tính năng hơn, nhưng bạn có thể dùng cách này nếu không thể cài hay chạy `bfg`.

source: In the below, replace `filepattern` may be a specific name or pattern, e.g. `*.jpg`. This will remove files matching the pattern from all history and branches.
vi: Trong lệnh bên dưới, thay `filepattern` với tên file hoặc khuông mẫu, v.d. `*.jpg`. Lệnh này sẽ xóa file theo khuôn mẫu khỏi tất cả lịch sử của tất cả các nhánh.

source: Behind-the-scenes explanation:
vi: Giải thích lệnh trên:

source: `--tag-name-filter cat` is a cumbersome, but simplest, way to apply the original tags to the new commits, using the command cat.
vi: `--tag-name-filter cat` khá là nặng, nhưng là cách đơn giản nhất để giữ nguyên các tags cho các commit mới bằng cách sử dụng lệnh `cat`.

source: `--prune-empty` removes any now-empty commits.
vi: `--prune-empty` xóa những commit bây giờ để trống rỗng.

source: #### Final Step: Pushing your changed repo history
vi: #### Bước cuối: Đẩy lịch sử đã thay đổi của repository

source: Once you have removed your desired files, test carefully that you haven't broken anything in your repo - if you have, it is easiest to re-clone your repo to start over. To finish, optionally use git garbage collection to minimize your local .git folder size, and then force push. ```sh (main)$ git reflog expire --expire=now --all && git gc --prune=now --aggressive (main)$ git push origin --force --tags ```
vi: Một khi bạn đã xóa file, kiểm tra thật cẩn thận là bạn không làm hỏng cái gì trong repo - và nếu bạn đã làm hỏng cái gì đó, dễ nhất là clone repo lại và bắt đầu từ đầu. Để kết thúc, bạn có thể dùng chức năng thu hồi rác (garbage collection) để giảm thiểu kích cỡ tệp .git và rồi push ép. c ```sh (main)$ git reflog expire --expire=now --all && git gc --prune=now --aggressive (main)$ git push origin --force --tags ```

source: Since you just rewrote the entire git repo history, the `git push` operation may be too large, and return the error `“The remote end hung up unexpectedly”`. If this happens, you can try increasing the git post buffer: ```sh (main)$ git config http.postBuffer 524288000 (main)$ git push --force ```
vi: Vì bạn vừa viết lại toàn bộ lịch sử git repository, lệnh `git push` có thể quá to để thi hành, và gửi lại thông điệp lỗi (error) `“The remote end hung up unexpectedly”`. Nếu việc này xảy ra, bạn có thể thử tăng post buffer của git: ```sh (main)$ git config http.postBuffer 524288000 (main)$ git push --force ```

source: If this does not work, you will need to manually push the repo history in chunks of commits. In the command below, try increasing `<number>` until the push operation succeeds. ```sh (main)$ git push -u origin HEAD~<number>:refs/head/main --force ``` Once the push operation succeeds the first time, decrease `<number>` gradually until a conventional `git push` succeeds.
vi: Nếu cách này không hiệu quả, bạn sẽ phải push thủ công lịch sử repo từng cục một. Với lệnh bên dưới, dần dần tăng con số cho `<số cục>` đến khi nào lệnh push thành công. ```sh (main)$ git push -u origin HEAD~<số cục>:refs/head/main --force ``` Một khi lệnh push thành công, dần dần giảm thiểu `<số cục>` cho đến khi một lệnh `git push` bình thường thành công.

source: <a href="i-need-to-change-the-content-of-a-commit-which-is-not-my-last"></a> ### I need to change the content of a commit which is not my last
vi: <a href="i-need-to-change-the-content-of-a-commit-which-is-not-my-last"></a> ### Tôi cần thay đổi nội dung của một commit nhưng không phải là cái mới nhất

source: Consider you created some (e.g. three) commits and later realize you missed doing something that belongs contextually into the first of those commits. This bothers you, because if you'd create a new commit containing those changes, you'd have a clean code base, but your commits weren't atomic (i.e. changes that belonged to each other weren't in the same commit). In such a situation you may want to change the commit where these changes belong to, include them and have the following commits unaltered. In such a case, `git rebase` might save you.
vi: Giả sử bạn đã có vài (v.d. ba) commit và sau nhận ra là bạn quên mất không cho vào một thứ gì đó hợp hơn với commit đầu tiên. Việc này làm phiền bạn vì mặc dù nếu tiếp tục commit bạn sẽ có lịch sử sạch sẽ nhưng commit của bạn không nguyên chất (những thay đổi liên quan với nhau nên ở cùng một commit). Trong trường hợp như vậy, bạn chắc muốn cho thêm những thay đổi liên quan vào commit mong muốn nhưng không muốn những commit sau tiếp cũng phải sửa theo. Trong trường hợp như vây, `git rebase` có thể cứu bạn.

source: Consider a situation where you want to change the third last commit you made.
vi: Hay xem trường hợp mà bạn muốn thay đổi commit số ba nếu đếm ngược.

source: ```sh (your-branch)$ git rebase -i HEAD~4 ```
vi: ```sh (nhánh-bạn)$ git rebase -i HEAD~4 ```

source: gets you into interactive rebase mode, which allows you to edit any of your last three commits. A text editor pops up, showing you something like
vi: Lệnh trên đưa bạn vào mode (chế độ) rebase tương tác (interactive rebase), chế độ cho phép bạn edit ba commit mới nhất. Một trình soạn thảo (text editor) sẽ bật lên trông giống như sau:

source: ```sh pick 9e1d264 The third last commit pick 4b6e19a The second to last commit pick f4037ec The last commit ```
vi: ```sh pick 9e1d264 commit trước ba pick 4b6e19a commit trước hai pick f4037ec commit trước ```

source: which you change into
vi: và bạn thay/viết thành:

source: ```sh edit 9e1d264 The third last commit pick 4b6e19a The second to last commit pick f4037ec The last commit ```
vi: ```sh edit 9e1d264 commit trước ba pick 4b6e19a commit trước hai pick f4037ec commit trước ```

source: This tells rebase that you want to edit your third last commit and keep the other two unaltered. Then you'll save (and close) the editor. Git will then start to rebase. It stops on the commit you want to alter, giving you the chance to edit that commit. Now you can apply the changes which you missed applying when you initially committed that commit. You do so by editing and staging them. Afterwards you'll run
vi: Lệnh này bảo rebase là bạn muốn thay đổi commit trước ba và giữ hai commit kia không thay đổi. Sau đó bạn save (và đóng) trình soạn thảo. Git bây giờ sẽ bắt đầu rebase. Nó dừng lại ở commit bạn để là edit và cho bạn cơ hội thay đổi commit đấy. Bây giờ bạn có thể cho thêm những thay đổi bạn lỡ không cho vào lần đầu. Để làm thế, bạn edit rồi stage những thay đổi đấyNow you can apply the changes which you missed applying when you initially committed that commit. Sau đó bạn chạy lệnh:

source: which tells Git to recreate the commit, but to leave the commit message unedited. Having done that, the hard part is solved.
vi: Lệnh bảo Git là cần tạo lại commit, nhưng giữ nguyên thông điệp commit. which tells Git to recreate the commit, but to leave the commit message unedited. Thế là xong phần khó nhất. Cuối cùng là chạy lệnh:

source: will do the rest of the work for you.
vi: Lệnh trên sẽ giải quyết phần còn lại.

source: ## Staging
vi: ## Staging (sân chuyển tiếp)

source: ### I want to stage all tracked files and leave untracked files
vi: ### Tôi muốn nâng lên stage tất cả file đang theo dõi và bỏ qua file không theo dõi

source: #### To stage part of tracked files
vi: #### Chỉ nâng một phần các file đang theo dõi

source: ```sh # to stage files with ext .txt $ git add -u *.txt
vi: ```sh # Để nâng các file dạng .txt $ git add -u *.txt

source: # to stage all files inside directory src $ git add -u src/ ```
vi: # Để nang các file trong thu mục src $ git add -u src/ ```

source: <a href="#i-need-to-add-staged-changes-to-the-previous-commit"></a> ### I need to add staged changes to the previous commit
vi: <a href="#i-need-to-add-staged-changes-to-the-previous-commit"></a> ### Tôi cần cho thêm các thay đổi đang trong stage vào commit trước

source: If you already know you don't want to change the commit message, you can tell git to reuse the commit message:
vi: Nếu bạn đã biết bạn không muốn thay đổi thông điệp commit, bạn có thể yêu cầu git sử dụng lại commit message:

source: <a name="commit-partial-new-file"></a> ### I want to stage part of a new file, but not the whole file
vi: <a name="commit-partial-new-file"></a> ### Tôi muốn stage một phần của một file mới, nhưng không phải toàn bộ file

source: Normally, if you want to stage part of a file, you run this:
vi: Thông thường, nếu bạn muốn stage một phần của một file, bạn chạy lệnh này:

source: `-p` will work for short. This will open interactive mode. You would be able to use the `s` option to split the commit - however, if the file is new, you will not have this option. To add a new file, do this:
vi: Bạn có thể dùng `-p` thay `--patch` cho ngắn. Lệnh này sẽ mở chế độ interactive. Bạn có thể cho thêm `s` để cắt commit - tuy nhiên, nếu là file mới, bạn sẽ không có lựa chọn này. Để thêm một file mới, làm như sau:

source: Then, you will need to use the `e` option to manually choose which lines to add. Running `git diff --cached` or `git diff --staged` will show you which lines you have staged compared to which are still saved locally.
vi: Sau đó, bạn sẽ cần sử dụng `e` để thủ công thêm dòng. Chạy lệnh `git diff --cached` hoặc `git diff --staged` sẽ cho bạn thấy những dòng bạn đã stage so với những dòng vẫn lưu ở local.

source: <a href="stage-in-two-commits"></a> ### I want to add changes in one file to two different commits
vi: <a href="stage-in-two-commits"></a> ### Tôi muốn thêm các thay đổi trong một file vào 2 commit khác nhau

source: `git add` will add the entire file to a commit. `git add -p` will allow to interactively select which changes you want to add.
vi: `git add` sẽ thêm toàn bộ file vào một commit. `git add -p` sẽ cho vào chế độ tương tác để chọn những thay đổi bạn muốn thêm vào.

source: <a href="selective-unstage-edits"></a> ### I staged too many edits, and I want to break them out into a separate commit
vi: <a href="selective-unstage-edits"></a> ### Tôi cho lên stage quá nhiều thay đổi, và tôi muốn tách ra thành các commit khác nhau

source: `git reset -p` will open a patch mode reset dialog. This is similar to `git add -p`, except that selecting "yes" will unstage the change, removing it from the upcoming commit.
vi: `git reset -p` sẽ mở chế độ patch và hộp thoại để reset. Việc này sẽ giống như với lệnh `git add -p`, ngoại trừ là việc chọn "yes" sẽ đưa thay đổi khỏi stage, loại trừ nó khỏi commit tiếp đến.

source: <a href="unstaging-edits-and-staging-the-unstaged"></a> ### I want to stage my unstaged edits, and unstage my staged edits
vi: <a href="unstaging-edits-and-staging-the-unstaged"></a> ### Tôi muốn cho lên stage các chỉnh sửa chưa được stage và hã khỏi stage các chỉnh sửa đã stage

source: In many cases, you should unstage all of your staged files and then pick the file you want and commit it. However, if you want to switch the staged and unstaged edits, you can create a temporary commit to store your staged files, stage your unstaged files and then stash them. Then, reset the temporary commit and pop your stash.
vi: Phần lớn thời gian, bạn nên hạ tất cả các file đã trên stage và chọn lại những file bạn muốn commit.Nhưng giả sử bạn muốn thay các thay đổi lên và hạ stage, bạn có thể tạo một commit tạm thời, nâng lên stage các thay đổi, rồi stash (cất) nó. Sau đó, reset cái commit tạm thời rồi pop cái stage bạn vừa cất.

source: ```sh $ git commit -m "WIP" $ git add . # This will also add untracked files. $ git stash $ git reset HEAD^ $ git stash pop --index 0 ```
vi: ```sh $ git commit -m "WIP" $ git add . # "." sẽ thêm tất cả file chưa theo dõi $ git stash $ git reset HEAD^ $ git stash pop --index 0 ```

source: NOTE 1: The reason to use `pop` here is want to keep idempotent as much as possible. NOTE 2: Your staged files will be marked as unstaged if you don't use the `--index` flag. ([This link](https://stackoverflow.com/questions/31595873/git-stash-with-staged-files-does-stash-convert-staged-files-to-unstaged?answertab=active#tab-top) explains why.)
vi: GHI CHÚ 1: Lý do để dùng `pop` là để giữ nguyên các thay đổi nhất có thể. GHI CHÚ 2: Các file đã nâng lên stage sẽ bị hạ nếu không có thêm cờ `--index`. ([Link](https://stackoverflow.com/questions/31595873/git-stash-with-staged-files-does-stash-convert-staged-files-to-unstaged?answertab=active#tab-top) explains why.)

source: ## Unstaged Edits
vi: ## Thay đổi chưa lên sân (Unstaged Edits)

source: <a href="move-unstaged-edits-to-new-branch"></a> ### I want to move my unstaged edits to a new branch
vi: <a href="move-unstaged-edits-to-new-branch"></a> ### Tôi muốn di chuyển các chỉnh sửa chưa lên stage sang một nhánh mới

source: ```sh $ git checkout -b my-branch ```
vi: ```sh $ git checkout -b nhánh-mới ```

source: <a href="move-unstaged-edits-to-old-branch"></a> ### I want to move my unstaged edits to a different, existing branch
vi: <a href="move-unstaged-edits-to-old-branch"></a> ### Tôi muốn di chuyển các chỉnh sửa chưa stage của tôi đến một nhánh khác đã tồn tại

source: ```sh $ git stash $ git checkout my-branch $ git stash pop ```
vi: ```sh $ git stash $ git checkout nhánh-tồn-tại $ git stash pop ```

source: <a href="i-want-to-discard-my-local-uncommitted-changes"></a> ### I want to discard my local uncommitted changes (staged and unstaged)
vi: <a href="i-want-to-discard-my-local-uncommitted-changes"></a> ### Tôi muốn bỏ các thay đôi chưa trong commit tại local (đã lên hoặc chưa lên stage)

source: If you want to discard all your local staged and unstaged changes, you can do this:
vi: Nếu bạn muốn bỏ tất cả các thay đổi đã lên hoặc chưa lên stage tại local của bạn, bạn có thể làm như sau:

source: ```sh (my-branch)$ git reset --hard # or (main)$ git checkout -f ```
vi: ```sh (my-branch)$ git reset --hard # hoặc (main)$ git checkout -f ```

source: This will unstage all files you might have staged with `git add`:
vi: Lệnh sau sẽ hạ khỏi stage tất cả thay đổi bạn đã cho lên stage với `git add`:

source: This will revert all local uncommitted changes (should be executed in repo root):
vi: Lệnh sau sẽ đảo ngược tất cả các thay đổi chưa commit tại local (nên chạy tại thư mục gốc repo):

source: You can also revert uncommitted changes to a particular file or directory:
vi: Bạn cũng có thể đảo ngược các thay đổi chưa commit cho một file hoặc một thư mục cụ thể:

source: ```sh $ git checkout [some_dir|file.txt] ```
vi: ```sh $ git checkout [thư_mục|file.txt] ```

source: Yet another way to revert all uncommitted changes (longer to type, but works from any subdirectory):
vi: Tuy nhiên, một cách khác để đảo ngược tất cả các thay đổi chưa commit (dài hơn để nhập, nhưng hoạt động từ bất kỳ thư mục con nào):

source: This will remove all local untracked files, so only files tracked by Git remain:
vi: Lệnh trên sẽ xoá tất cả các file chưa được theo dõi(untracked) tại local, do đó, chỉ các file đã được theo dõi bởi git (tracked) còn tồn:

source: `-x` will also remove all ignored files.
vi: Thêm cờ `-x` để xoá tất cả các file đã ignore.

source: ### I want to discard specific unstaged changes
vi: ### Tôi muốn loại bỏ các thay đổi cụ thể chưa lên stage

source: When you want to get rid of some, but not all changes in your working copy.
vi: Khi bạn muốn loại bỏ một số, nhưng không phải tất cả, các thay đổi trong bản sao làm việc của bạn.

source: Checkout undesired changes, keep good changes.
vi: Checkout các thay đổi không mong muốn, giữ các thay đổi tốt.

source: ```sh $ git checkout -p # Answer y to all of the snippets you want to drop ```
vi: ```sh $ git checkout -p # Trả lời y đối với những thay đổi bạn không muốn giữ ```

source: Another strategy involves using `stash`. Stash all the good changes, reset working copy, and reapply good changes.
vi: Một cách khác thì sử dụng `stash` (cất). Cất tất cả các thay đổi tốt, reset bản sao làm việc và apply lại các thay đổi tốt.

source: ```sh $ git stash -p # Select all of the snippets you want to save $ git reset --hard $ git stash pop ```
vi: ```sh $ git stash -p # Chọn những thay đổi bạn muốn giữ $ git reset --hard $ git stash pop ```

source: Alternatively, stash your undesired changes, and then drop stash.
vi: Ngoài ra, còn cách cất những thay đổi không mong muốn của bạn và sau đó drop stash.

source: ```sh $ git stash -p # Select all of the snippets you don't want to save $ git stash drop ```
vi: ```sh $ git stash -p # Chọn những thay đổi bạn không muốn giữ $ git stash drop ```

source: ### I want to discard specific unstaged files
vi: ### Tôi muốn loại bỏ các file cụ thể chưa lên stage

source: When you want to get rid of one specific file in your working copy.
vi: Khi bạn muốn loại bỏ một file cụ thể trong bản sao làm việc của bạn.

source: ```sh $ git checkout myFile ```
vi: ```sh $ git checkout FileCủaTôi ```

source: Alternatively, to discard multiple files in your working copy, list them all.
vi: Ngoài ra, để loại bỏ nhiều file trong bản sao làm việc của bạn, hãy liệt kê tất cả chúng.

source: ```sh $ git checkout myFirstFile mySecondFile ```
vi: ```sh $ git checkout FileThứNhất FileThứHai ```

source: ### I want to discard only my unstaged local changes
vi: ### Tôi muốn chỉ loại bỏ các thay đổi chưa lên stage tại local
