Repository: VietThan/git-flight-rules
Catalog: README_*.po
Languages: vi

source: ## Repositories
vi: ## Repositories (Kho)

source: ### I want to start a local repository
vi: ### Tôi muốn tạo một repository trên local

source: To initialize an existing directory as a Git repository:
vi: Để tạo một Git repository tại thư mục đã tồn tại:

source: ```sh (my-folder) $ git init ```
vi: ```sh (thư-mục-của-tôi) $ git init ```

source: ### I want to clone a remote repository
vi: ### Tôi muốn clone một remote repository

source: To clone (copy) a remote repository, copy the URL for the repository, and run:
vi: Để clone (copy) một remote repository, copy đường dẫn url cho repository, và chạy :

source: This will save it to a folder named the same as the remote repository's. Make sure you have a connection to the remote server you are cloning from (for most purposes this means making sure you are connected to the internet).
vi: Lệnh này sẽ tải xuống một thư mục có tên giống tên của remote repository. Hãy chắc chắn rằng bạn có kết nối đến remote server khi bạn đang clone về (phần lớn thời gian nghĩa là cần đảm bảo bạn kết nối được với internet).

source: To clone it into a folder with a different name than the default repository name:
vi: Để clone vào một thư mục với tên khác với tên mặc định của repository:

source: ### I set the wrong remote repository
vi: ### Tôi để sai remote repository

source: There are a few possible problems here:
vi: Có thể có vài vấn đề khác nhau:

source: If you cloned the wrong repository, simply delete the directory created after running `git clone` and clone the correct repository.
vi: Nếu bạn clone sai repository, chỉ cần xóa thư mục tạo bởi `git clone` và sau đó clone đúng remote repository.

source: If you set the wrong repository as the origin of an existing local repository, change the URL of your origin by running:
vi: Nếu bạn để nhầm repository là origin của một local repository hiện tại, thay đổi URL của origin với lệnh:

source: ```sh $ git remote set-url origin [url of the actual repo] ```
vi: ```sh $ git remote set-url origin [url của repo đúng] ```

source: For more, see [this StackOverflow topic](https://stackoverflow.com/questions/2432764/how-to-change-the-uri-url-for-a-remote-git-repository#2432799).
vi: Xem thêm tại [StackOverflow](https://stackoverflow.com/questions/2432764/how-to-change-the-uri-url-for-a-remote-git-repository#2432799).

source: ### I want to add code to someone else's repository
vi: ### Tôi muốn thêm sửa code cho repository của người khác

source: Git doesn't allow you to add code to someone else's repository without access rights. Neither does GitHub, which is not the same as Git, but rather a hosted service for Git repositories. However, you can suggest code using patches, or, on GitHub, forks and pull requests.
vi: Git không cho bạn thêm sửa code vào repository của người khác nếu không có quyền truy cập. GitHub cũng thế, GitHub khác với Git vì là dịch vụ hosting cho các Git repository. Nhưng bạn có thể thêm sửa code với các patch vá lỗi, hoặc, nếu trên GitHub, với forks và pull requests.

source: First, a bit about forking. A fork is a copy of a repository. It is not a git operation, but is a common action on GitHub, Bitbucket, GitLab — or anywhere people host Git repositories. You can fork a repository through the hosted UI.
vi: Trước hêt, một vài điều về fork. Một fork là một copy của một repository. Đây không phải là một lệnh git, mà là một hành động thường thấy trên GitHub, Bitbucket, GitLab — hoặc bắt cứ đâu host các Git repository. Bạn có thể fork một repository qua UI của dịch vụ host.

source: #### Suggesting code via pull requests
vi: #### Thêm sửa code với pull requests

source: After you've forked a repository, you normally need to clone the repository to your machine. You can do some small edits on GitHub, for instance, without cloning, but this isn't a github-flight-rules list, so let's go with how to do this locally.
vi: Sau khi đã fork một repository, bạn thường phải clone repository về máy của bạn. Tất nhiên bạn có thể tạo vài chỉnh sửa nhỏ trên GitHub nếu không clone về máy, nhưng văn bản này không phải là github-flight-rules, thế nên hãy xem cách trên máy local.

source: ```sh # if you are using ssh $ git clone git@github.com:k88hudson/git-flight-rules.git
vi: ```sh # nếu bạn dùng ssh $ git clone git@github.com:k88hudson/git-flight-rules.git

source: # if you are using https $ git clone https://github.com/k88hudson/git-flight-rules.git ```
vi: # nếu bạn dùng https $ git clone https://github.com/k88hudson/git-flight-rules.git ```

source: If you `cd` into the resulting directory, and type `git remote`, you'll see a list of the remotes. Normally there will be one remote - `origin` - which will point to `k88hudson/git-flight-rules`. In this case, we also want a remote that will point to your fork.
vi: Nếu bạn `cd` vào thư mục được tạo, và chạy lệnh `git remote`, bạn sẽ thấy danh sách các remote. Thường sẽ có một remote - `origin` - trỏ đến `k88hudson/git-flight-rules`. Trong trường hợp này, bạn cũng muốn một remote trỏ đến fork của bạn.

source: First, to follow a Git convention, we normally use the remote name `origin` for your own repository and `upstream` for whatever you've forked. So, rename the `origin` remote to `upstream`
vi: Đầu tiên, để theo quy chuẩn dùng Git, chúng ta sẽ dùng remote tên `origin` cho repository của bạn và tên `upstream` cho repository mà bạn fork. Để đổi tên cho remote `origin` sang tên `upstream` chạy lệnh:

source: You can also do this using `git remote set-url`, but it takes longer and is more steps.
vi: Bạn cũng có thể đổi tên với lệnh `git remote set-url`, nhưng sẽ mất thêm thời gian và nhiều bước hơn.

source: Then, set up a new remote that points to your project.
vi: Sau đó, tạo remote mới để trỏ về repository của bạn.

source: ```sh $ git remote add origin git@github.com:YourName/git-flight-rules.git ```
vi: ```sh $ git remote add origin git@github.com:YourtGitHubUsername/git-flight-rules.git ```

source: Note that now you have two remotes.
vi: Lưu ý là bây giờ bạn có hai remote.

source: - `origin` references your own repository. - `upstream` references the original one.
vi: - `origin` trỏ đến repository của bạn. - `upstream` trỏ đến repository nguyên bản .

source: From origin, you can read and write. From upstream, you can only read.
vi: Với `origin`, bạn có thể đọc và viết. Với `upstream`, bạn chỉ có thể đọc.

source: When you've finished making whatever changes you like, push your changes (normally in a branch) to the remote named `origin`. If you're on a branch, you could use `--set-upstream` to avoid specifying the remote tracking branch on every future push using this branch. For instance:
vi: Sau khi đã chỉnh sửa theo mong muốn, push (đẩy) các thay đổi (thường là ở trong branch) tới remote tên `origin`. Nếu bạn ở trên nhánh, bạn có thể dùng `--set-upstream` để tránh cần phải ghi rõ dùng brach nào của remote mỗi lần push trong tương lai khi dùng nhánh đấy. Ví dụ:

source: There is no way to suggest a pull request using the CLI using Git (although there are tools, like [hub](http://github.com/github/hub), which will do this for you). So, if you're ready to make a pull request, go to your GitHub (or another Git host) and create a new pull request. Note that your host automatically links the original and forked repositories.
vi: Không có cách nào để tạo pull request trên giao diện lệnh (CLI) với Git (mặc dù có vài công cụ, như [hub](http://github.com/github/hub), có cho bạn lựa chọn này). Nếu bạn sãn sàng tạo Pull Request, trở lại GitHub (hoặc dịch vụ host Git) và tạo pull request mới. Nhớ là dịch vụ host sẽ tự động link repository nguyên bản và repository do fork.

source: After all of this, do not forget to respond to any code review feedback.
vi: Sau cùng, nhớ đùng quên trả lời những comment phê duyệt code.

source: #### Suggesting code via patches
vi: #### Thêm sửa code với các patch (vá)

source: Another approach to suggesting code changes that doesn't rely on third party sites such as Github is to use `git format-patch`.
vi: Một cách khác để thêm sửa code mà không cần sử dụng dịch vụ bên thứ ba như GitHub là dùng `git format-patch`.

source: `format-patch` creates a .patch file for one or more commits. This file is essentially a list of changes that looks similar to the commit diffs you can view on Github.
vi: `format-patch` tạo file (tệp) dạng .patch cho một hoặc nhiều commit. File này là cơ bản là danh sách nhưng thay đổi, giống như những commit diffs bạn xem được trên Github.

source: A patch can be viewed and even edited by the recipient and applied using `git am`.
vi: Các patch có thể được xem hoặc thậm chí thêm sửa bởi người nhận và áp gắn với lệnh `git am`.

source: For example, to create a patch based on the previous commit you would run `git format-patch HEAD^` which would create a .patch file called something like 0001-My-Commit-Message.patch.
vi: Ví dụ, để tạo patch dựa vào commit mới nhât, bạn chạy lệnh `git format-patch HEAD^`, lệnh sẽ tạo một tệp .patch với tên như: `0001-My-Commit-Message.patch`.

source: To apply this patch file to your repository you would run `gim am ./0001-My-Commit-Message.patch`.
vi: Để áp gắn tệp patch cho repository, bạn sẽ dùng lệnh `gim am ./0001-My-Commit-Message.patch`.

source: Patches can also be sent via email using the `git send-email` command. For information on usage and configuration see: https://git-send-email.io
vi: Các patch còn có thể gửi qua email với lệnh `git send-email`. Để xem thêm thông tin về cách dùng hoặc cấu hình, xem: https://git-send-email.io

source: #### I need to update my fork with latest updates from the original repository
vi: #### Tôi cần update fork của tôi với những thay đổi mới nhất từ repository nguyên bản

source: After a while, the `upstream` repository may have been updated, and these updates need to be pulled into your `origin` repo. Remember that like you, other people are contributing too. Suppose that you are in your own feature branch and you need to update it with the original repository updates.
vi: Sau một quãng thời gian, kho `upstream` có thể có thêm thay đổi, và những thay đổi này cần phải được tải về kho `origin`. Nhớ là giống bạn, những người khác cũng đang góp sức của họ. Giả dụ bạn đang ở nhánh cho tính năng mới bạn đang thiết kế, và bạn cần update nhánh với những thay đổi trên repository nguyên bản.

source: You probably have set up a remote that points to the original project. If not, do this now. Generally we use `upstream` as a remote name:
vi: Có khi bạn đã có remote trỏ đến project nguyên bản. Nếu không, hãy tạo nó. Thường chúng ta dùng tên `upstream` cho remote này:

source: ```sh $ (main) git remote add upstream <link-to-original-repository> # $ (main) git remote add upstream git@github.com:k88hudson/git-flight-rules.git ```
vi: ```sh $ (main) git remote add upstream <link-tới-repository-nguyên-bản> # $ (main) git remote add upstream git@github.com:k88hudson/git-flight-rules.git ```

source: Now you can fetch from upstream and get the latest updates.
vi: Bây giờ bạn fetch (lấy) từ `upstream` và nhận những update mới nhất.

source: # or using a single command $ (main) git pull upstream main ```
vi: # hoặc với một lệnh duy nhất $ (main) git pull upstream main ```

source: ## Editing Commits
vi: ## Chỉnh sửa Commit

source: <a name="diff-last"></a> ### What did I just commit?
vi: <a name="diff-last"></a> ### Tôi vừa commit cái gì?

source: Let's say that you just blindly committed changes with `git commit -a` and you're not sure what the actual content of the commit you just made was. You can show the latest commit on your current HEAD with:
vi: Giả sử bạn vừa commit những thay đổi một cách mù quáng với lệnh `git commit -a` và bạn không chắc chắn nội dung thực sự của commit vừa thực hiện là gì. Bạn có thể hiển thị ra commit gần nhất trên trỏ HEAD hiện tại của bạn với lệnh:

source: Or
vi: Hoặc

source: If you want to see a file at a specific commit, you can also do this (where `<commitid>` is the commit you're interested in):
vi: Nếu bạn muốn xem một file tại một commit cụ thể, bạn cũng có thể làm được điều này (khi `<commitid>` là commit mà bạn muốn biết) với lệnh:

source: ### I wrote the wrong thing in a commit message
vi: ### Tôi đã viết sai vài thứ trong message (thông điệp) của commit

source: If you wrote the wrong thing and the commit has not yet been pushed, you can do the following to change the commit message without changing the changes in the commit:
vi: Nếu bạn đã viết sai thứ gì đó và commit chưa được push lên, bạn có thể làm theo cách sau để thay đổi message của commit mà không làm thay đổi commit:

source: This will open your default text editor, where you can edit the message. On the other hand, you can do this all in one command:
vi: Câu lệnh đó sẽ mở trình soạn thảo (text editor) mặc định của bạn, nơi bạn có thể chỉnh sửa message. Ngoài ra, bạn có thể làm tất cả điều này với lệnh sau:

source: If you have already pushed the message, you can amend the commit and force push, but this is not recommended.
vi: Nếu bạn đã đẩy message lên, bạn có thể chỉnh sửa commit và force push (đẩy ép), nhưng cách này không được khuyến khích.

source: <a name="commit-wrong-author"></a> ### I committed with the wrong name and email configured
vi: <a name="commit-wrong-author"></a> ### Tôi đã commit với cấu hình tên và email sai

source: If it's a single commit, amend it
vi: Nếu đó là một commit độc lập, chỉnh sửa nó:

source: ```sh $ git commit --amend --no-edit --author "New Authorname <authoremail@mydomain.com>" ```
vi: ```sh $ git commit --amend --no-edit --author "TênTácGiảMới <authoremail@mydomain.com>" ```

source: An alternative is to correctly configure your author settings in `git config --global author.(name|email)` and then use
vi: Một cách khác để cấu hình đúng tác giả là cài đặt lại với lệnh `git config --global author.(name|email)` và sau đó chạy lệnh

source: If you need to change all of history, see the man page for `git filter-branch`.
vi: Nếu bạn cần thay đổi tất cả lịch sử, hãy xem trang `man` của `git filter-branch`.

source: ### I want to remove a file from the previous commit
vi: ### Tôi muốn xoá một file từ commit trước

source: In order to remove changes for a file from the previous commit, do the following:
vi: Để xoá các thay đổi đối với một file khỏi commit trước, hãy làm như sau:

source: In case the file was newly added to the commit and you want to remove it (from Git alone), do:
vi: Trong trường hợp file mới được thêm vào commit và bạn muốn xoá nó (riêng trên Git), hãy thực hiện:

source: This is particularly useful when you have an open patch and you have committed an unnecessary file, and need to force push to update the patch on a remote. The `--no-edit` option is used to keep the existing commit message.
vi: Cách này đăc biệt hữu ích khi bạn đang mở một bản patch và bạn đã commit một file không cần thiết và cần force push để cập nhật bản patch trên remote. Dòng `--no-edit` được dùng để giữ không thay đổi message cho commit hiện tại.

source: <a name="delete-pushed-commit"></a> ### I want to delete or remove my last commit
vi: <a name="delete-pushed-commit"></a> ### Tôi muốn xoá hoặc loại bỏ commit mới nhất

source: If you need to delete pushed commits, you can use the following. However, it will irreversibly change your history, and mess up the history of anyone else who had already pulled from the repository. In short, if you're not sure, you should never do this, ever.
vi: Nếu bạn muốn xoá các commit đã push, bạn có thể làm như sau. Tuy nhiên, cách này sẽ thay đổi lịch sử commit không thay đổi được và làm hỏng lịch sử của bất kỳ ai khác đã pull từ repository. Tóm lại, nếu bạn không chắc chắn, bạn không bao giờ nên làm cách này.

source: If you haven't pushed, to reset Git to the state it was in before you made your last commit (while keeping your staged changes):
vi: Nếu bạn chưa push, để đảo ngược Git về trạng thái trước khi bạn thực hiện commit mới nhất (trong khi vãn giữ các thay đổi trong stage) hãy chạy lệnh:

source: This only works if you haven't pushed. If you have pushed, the only truly safe thing to do is `git revert SHAofBadCommit`. That will create a new commit that undoes all the previous commit's changes. Or, if the branch you pushed to is rebase-safe (ie. other devs aren't expected to pull from it), you can just use `git push --force-with-lease`. For more, see [the above section](#deleteremove-last-pushed-commit).
vi: Cách này chỉ phù hợp nếu bạn chưa push. Nếu bạn đã push, điều thực sự an toàn nhất cần làm là `git revert SHAcủaCommitSai`. Lệnh này sẽ tạo một commit mới để quay trở lại thay đổi của commit trước đó. Hoặc nếu nhánh bạn đã push là rebase-safe (không có kỳ vọng các dev khác sẽ pull từ nó), bạn chỉ có thể sử dụng `git push --force-with-lease`. Để biết thêm, hãy xem [phần trên](#delete-pushed-commit).

source: <a name="delete-any-commit"></a> ### Delete/remove arbitrary commit
vi: <a name="delete-any-commit"></a> ### Xoá/loại bỏ bất kỳ commit nào

source: The same warning applies as above. Never do this if possible.
vi: Lưu ý như trên. Không bao giờ làm điều này nếu có thể tránh được.

source: Or do an [interactive rebase](#interactive-rebase) and remove the line(s) corresponding to commit(s) you want to see removed.
vi: Hoặc thực hiện một [interactive rebase](#interactive-rebase) và loại bỏ các dòng tương ứng với các commit bạn muốn loại bỏ.

source: <a name="#force-push"></a> ### I tried to push my amended commit to a remote, but I got an error message
vi: <a name="#force-push"></a> ### Tôi đã cố gắng push commit đã sửa đổi lên remote, nhưng tôi gặp thông báo lỗi

source: Note that, as with rebasing (see below), amending **replaces the old commit with a new one**, so you must force push (`--force-with-lease`) your changes if you have already pushed the pre-amended commit to your remote. Be careful when you do this &ndash; *always* make sure you specify a branch!
vi: Lưu ý rằng, như với rebase (xem bên dưới), amend **thay thế commit cũ với một commit mới**, nên bạn phải force push (`--force-with-lease`) các thay đổi của bạn nếu bạn đã push commit trước amend lên remote của bạn. Hãy cẩn thận khi bạn cách này &ndash; *luôn luôn* đảm bảo rằng bạn đã chỉ định một nhánh!

source: In general, **avoid force pushing**. It is best to create and push a new commit rather than force-pushing the amended commit as it will cause conflicts in the source history for any other developer who has interacted with the branch in question or any child branches. `--force-with-lease` will still fail, if someone else was also working on the same branch as you, and your push would overwrite those changes.
vi: Nói chung, **tránh force push**. Tốt nhất là tạo và push một commit mới thay vì force-push commit đã sửa đổi vì nó sẽ gây xung đột trong lịch sử commit cho bất kỳ developer nào đã tương tác với nhánh được đề cập hoặc bất kỳ nhánh con nào. `--force-with-lease` sẽ vẫn fail, nếu ai khác cũng đang làm việc trên cùng một nhánh với bạn và việc push lên sẽ ép trên những thay đổi đó.

source: If you are *absolutely* sure that nobody is working on the same branch or you want to update the tip of the branch *unconditionally*, you can use `--force` (`-f`), but this should be avoided in general.
vi: Nếu bạn *hoàn toàn chắc chắn* rằng không ai đang làm việc trên cùng một nhánh hoặc bạn muốn cập nhật đỉnh nhánh (tip of branch) *vô điều kiện*, bạn có thể sử dụng `--force` (`-f`), nhưng cách này nói chung nên tránh.

source: <a href="undo-git-reset-hard"></a> ### I accidentally did a hard reset, and I want my changes back
vi: <a href="undo-git-reset-hard"></a> ### Tôi đã vô tình thực hiện hard reset và tôi muốn các thay đổi của tôi.

source: If you accidentally do `git reset --hard`, you can normally still get your commit back, as git keeps a log of everything for a few days.
vi: Nếu vô tình bạn thực hiện `git reset --hard`, bạn có thể vẫn phục hồi lại được commit của bạn, vì git giữ một bản log cho tất cả mọi thứ trong vài ngày.

source: Note: This is only valid if your work is backed up, i.e., either committed or stashed. `git reset --hard` _will remove_ uncommitted modifications, so use it with caution. (A safer option is `git reset --keep`.)
vi: Chú ý: Điều này chỉ hợp lệ nếu đã có sao lưu, tức là đã có commit hoặc được `stash`. Lệnh `git reset --hard` *sẽ loại bỏ* các thay đổi chưa được commit, vì vậy hãy sử dụng nó một cách thận trọng. (Một lựa chọn an toàn là `git reset --keep`.)

source: You'll see a list of your past commits, and a commit for the reset. Choose the SHA of the commit you want to return to, and reset again:
vi: Bạn sẽ thấy danh sách các commit gần đây và một commit để reset. Chọn SHA của commit bạn muốn trở lại tới và reset lại:

source: And you should be good to go.
vi: Thế này là xong.

source: <a href="undo-a-commit-merge"></a> ### I accidentally committed and pushed a merge
vi: <a href="undo-a-commit-merge"></a> ### Tôi vô tình commit và đẩy lên một merge

source: If you accidentally merged a feature branch to the main development branch before it was ready to be merged, you can still undo the merge. But there's a catch: A merge commit has more than one parent (usually two).
vi: Nếu bạn vô tình merge một nhánh tính năng mới vào nhánh phát triển chính trước khi sẵn sàng để merge, bạn vẫn có thể đảo ngược merge. Nhưng có một điểm phải nắm được: Một commit merge có một hoặc nhiều hơn một parent (gốc) (thường là 2).

source: The command to use ```sh (feature-branch)$ git revert -m 1 <commit> ``` where the -m 1 option says to select parent number 1 (the branch into which the merge was made) as the parent to revert to.
vi: Lệnh để chạy: ```sh (feature-branch)$ git revert -m 1 <commit> ``` Dòng `-m 1` là để cho biết cần chọn parent thứ nhất` (nhánh mà merge được thực hiện) làm parent để đảo ngược lại.

source: Note: the parent number is not a commit identifier. Rather, a merge commit has a line `Merge: 8e2ce2d 86ac2e7`. The parent number is the 1-based index of the desired parent on this line, the first identifier is number 1, the second is number 2, and so on.
vi: Chú ý: Số parent không phải là số commit. Thay vào đó, một commit merge sẽ có một dòng như `Merge: 8e2ce2d 86ac2e7`. Số parent là số số nhận dạng đầu-1 (1-based index) của dòng nay, số nhận dạng đầu tiên là 1 cho parent thứ nhất, thứ 2 là cho parent 2, và tiếp tục như thế.

source: <a href="undo-sensitive-commit-push"></a> ### I accidentally committed and pushed files containing sensitive data
vi: <a href="undo-sensitive-commit-push"></a> ### Tôi vô tình commit và đẩy các file chứa dữ liệu nhảy cảm

source: If you accidentally pushed files containing sensitive, or private data (passwords, keys, etc.), you can amend the previous commit. Keep in mind that once you have pushed a commit, you should consider any data it contains to be compromised. These steps can remove the sensitive data from your public repo or your local copy, but you **cannot** remove the sensitive data from other people's pulled copies. If you committed a password, **change it immediately**. If you committed a key, **re-generate it immediately**. Amending the pushed commit is not enough, since anyone could have pulled the original commit containing your sensitive data in the meantime.
vi: Nếu bạn vô tình push lên các file chứa dữ liệu nhạy cảm (mật khẩu, keys, etc.), bạn có thể amend commit trước. Lưu ý rằng khi bạn đã đẩy một commit, bạn nên coi bất kỳ dữ liệu nào đã bị đẩy như đã bị lộ. Các bước này có thể xoá dữ liệu nhạy cảm từ repo công khai (public repo) hoặc bản sao nội bộ, nhưng bạn *không thể* xóa dữ liệu nhạy cảm khỏi các bản sao đã được tải về bởi người khác. Nếu bạn có commit mật khẩu, *hãy thay đổi mật khẩu ngay lập tức*. Nếu bạn đã commit một key, *hãy tạo lại key đó ngay lập tức*. Việc amend commit đã đẩy là không đủ, vì bất kỳ ai cũng có thể đã pull commit chứa dữ liệu nhạy cảm của bạn trong thời gian đấy.
