Repository: VietThan/git-flight-rules
Catalog: README_*.po
Languages: vi

source: You will now check if this commit is good or bad. If it's good:
vi: Bạn kiểm tra commit xem tốt hay tồi. Nếu tốt:

source: and `git-bisect` will select another commit from the range for you. This process (selecting `good` or `bad`) will repeat until there are no more revisions left to inspect, and the command will finally print a description of the **first** bad commit.
vi: và `git-bisect` sẽ chọn một commit khác trong phạm vi của bạn. Quá trình này sẽ tiếp tục lặp lại cho đến khi không còn sửa đổi cần kiểm tra, và lệnh sẽ cuối cùng in ra mô tả của commit tồi **đầu tiên**

source: ## Configuration
vi: ## Cấu hình (Configuration)

source: ### I want to add aliases for some Git commands
vi: ### Tôi muốn thêm bí danh (alias) cho một số lệnh Git

source: On OS X and Linux, your git configuration file is stored in ```~/.gitconfig```. I've added some example aliases I use as shortcuts (and some of my common typos) in the ```[alias]``` section as shown below:
vi: Trên OS X và Linux, file cấu hình git được lưu trong ```~/.gitconfig```. Tôi đã thêm một số bí danh mẫu mà tôi sử dụng làm shortcut (và một số lỗi chính tả phổ biến của tôi) trong phần ```[alias]``` được hiển thị như dưới đây:

source: ### I want to add an empty directory to my repository
vi: ### Tôi muốn thêm một thư mục trống vào repository của tôi

source: You can’t! Git doesn’t support this, but there’s a hack. You can create a .gitignore file in the directory with the following contents:
vi: Bạn không thể! Git không hỗ trợ điều này, nhưng có một hack. Bạn có thể tạo tệp .gitignore trong thư mục với các nội dung sau:

source: ``` # Ignore everything in this directory * # Except this file !.gitignore ```
vi: ``` # Bỏ qua tất cả mọi thứ trong repository * # Ngoại trừ file này !.gitignore ```

source: Another common convention is to make an empty file in the folder, titled .gitkeep.
vi: Một quy ước chung khác là tạo một tệp trống trong thư mục có tên .gitkeep.

source: You can also name the file as just .keep , in which case the second line above would be ```touch mydir/.keep```
vi: Bạn cũng có thể đặt tên tệp là .keep, trong trường hợp đó dòng thứ hai ở trên sẽ ```touch mydir/.keep```

source: ### I want to cache a username and password for a repository
vi: ### Tôi muốn cache (cho vào bộ nhớ đệm) một username và password cho một repository

source: You might have a repository that requires authentication. In which case you can cache a username and password so you don't have to enter it on every push and pull. Credential helper can do this for you.
vi: Bạn có thể có một repository yêu cầu xác thực (authentication). Trong trường hợp này bạn có thể cache một username và password vì vậy bạn không phải nhập nó vào mỗi lần push / pull. Phụ tá chứng chỉ(credential.helper) có thể làm điều này cho bạn.

source: ```sh $ git config --global credential.helper cache # Set git to use the credential memory cache ```
vi: ```sh $ git config --global credential.helper cache # Đặt git dùng bộ nhớ đệm chứng chỉ ```

source: ```sh $ git config --global credential.helper 'cache --timeout=3600' # Set the cache to timeout after 1 hour (setting is in seconds) ```
vi: ```sh $ git config --global credential.helper 'cache --timeout=3600' # Đặt bộ nhớ đệm kết thúc sau 1h (cấu hình dùng giây/s) ```

source: To find a credential helper:
vi: Để tìm phụ tá chứng chỉ:

source: ```sh $ git help -a | grep credential # Shows you possible credential helpers ```
vi: ```sh $ git help -a | grep credential # Phô bày các phụ tá chứng chỉ ```

source: For OS specific credential caching:
vi: Bộ nhớ đệm chứng chỉ cho các hệ điều hành (operating system/OS) cụ thể :

source: ```sh $ git config --global credential.helper osxkeychain # For OSX ```
vi: ```sh $ git config --global credential.helper osxkeychain # cho OSX ```

source: ```sh $ git config --global credential.helper gnome-keyring # Ubuntu and other GNOME-based distros ```
vi: ```sh $ git config --global credential.helper gnome-keyring # Ubuntu và các bản phân phối dựa trên GNOME ```

source: More credential helpers can likely be found for different distributions and operating systems.
vi: Các phụ tá chứng chỉ khác có khả năng cao tìm được cho các bản phân phối và hệ điều hành khác.

source: ### I want to make Git ignore permissions and filemode changes
vi: ### Tôi muốn Git bỏ qua các quyền và thay đổi về filemode (chế độ file)

source: If you want to make this the default behaviour for logged-in users, then use:
vi: Nếu bạn muốn đặt hành vi này là hành vi mặc định cho người dùng đã đăng nhập, thì hãy sử dụng:

source: ### I want to set a global user
vi: ### Tôi muốn đặt người dùng toàn cục (global user)

source: To configure user information used across all local repositories, and to set a name that is identifiable for credit when review version history:
vi: Để cấu hình thông tin người dùng được sử dụng trên tất cả các repository tại local và để đặt tên có thể nhận dạng khi xem lịch sử phiên bản:

source: ```sh $ git config --global user.name “[firstname lastname]” ```
vi: ```sh $ git config --global user.name "[tên-riêng tên-họ]" ```

source: To set an email address that will be associated with each history marker:
vi: Để đặt địa chỉ email gắn với mỗi mốc lịch sử:

source: ```sh git config --global user.email “[valid-email]” ```
vi: ```sh git config --global user.email "[email-có-hiệu-lực]" ```

source: ## I've no idea what I did wrong
vi: ## Tôi không biết mình đã làm gì sai

source: So, you're screwed - you `reset` something, or you merged the wrong branch, or you force pushed and now you can't find your commits. You know, at some point, you were doing alright, and you want to go back to some state you were at.
vi: Ok, bạn gặp rắc rối lớn - bạn `reset` vài thứ, hoặc bạn merge sai nhánh, hoặc bạn push ép (force push) và bây giờ bạn không thể tìm thấy các commit của bạn. Bạn biết, tại một số thời điểm, bạn không có vấn đề và bạn muốn quay trở lại trạng thái bạn đang ở đó.

source: This is what `git reflog` is for. `reflog` keeps track of any changes to the tip of a branch, even if that tip isn't referenced by a branch or a tag. Basically, every time HEAD changes, a new entry is added to the reflog. This only works for local repositories, sadly, and it only tracks movements (not changes to a file that weren't recorded anywhere, for instance).
vi: Đây là tình huống cho `git reflog`. `reflog` theo dõi bất kỳ thay đổi nào đối với đầu nhánh, ngay cả khi đầu nhánh đó không được tham chiếu bởi nhánh hoặc tag. Về cơ bản, mỗi lần HEAD thay đổi, một mục mới được thêm vào reflog. Thật đáng buồn là cách này chỉ hoạt động tốt đối với các repository ở local, và nó chỉ theo dõi các chuyển động (ví dụ: không thay đổi một tệp không được ghi ở bất kỳ đâu).

source: The reflog above shows a checkout from main to the 2.2 branch and back. From there, there's a hard reset to an older commit. The latest activity is represented at the top labeled `HEAD@{0}`.
vi: Các reflog ở trên cho thấy một checkout từ main đến nhánh 2.2 rồi quay trở lại. Từ đó, có một reset cứng về một commit cũ hơn. Hoạt động mới nhất được thể hiện ở đầu được gắn nhãn `HEAD@{0}`.

source: If it turns out that you accidentally moved back, the reflog will contain the commit main pointed to (0254ea7) before you accidentally dropped 2 commits.
vi: Nếu nó chỉ ra rằng bạn vô tình di chuyển trở lại, các reflog sẽ chứa commit mà main chỉ đến (0254ea7) trước khi bạn vô tình giảm 2 commit

source: Using `git reset` it is then possible to change main back to the commit it was before. This provides a safety net in case history was accidentally changed.
vi: Sử dụng `git reset` để có thể thay đổi main trở về commit trước đó. Cách này cung cấp mạng lưới an toàn trong trường hợp lịch sử vô tình bị thay đổi.

source: (copied and edited from [Source](https://www.atlassian.com/git/tutorials/rewriting-history/git-reflog)).
vi: (đã sao chép và chỉnh sửa từ [Source](https://www.atlassian.com/git/tutorials/rewriting-history/git-reflog)).

source: <a name="git-shortcuts"></a> ## Git Shortcuts
vi: <a name="git-shortcuts"></a> ## Git Shortcuts (phím tắt)

source: Once you're comfortable with what the above commands are doing, you might want to create some shortcuts for Git Bash. This allows you to work a lot faster by doing complex tasks in really short commands.
vi: Một khi bạn thấy thoải mái với các lệnh trên, bạn có thể muốn tạo các phím tắt cho Git Bash. Cách này giúp bạn làm việc nhanh hơn vì chạy các hành vi phức tạp với các lệnh ngắn hơn.

source: Copy those commands to your .bashrc or .bash_profile.
vi: Copy các lệnh này vào .bashrc hoặc .bash_profile của bạn.

source: ### PowerShell on Windows
vi: ### PowerShell trên Windows

source: If you are using PowerShell on Windows, you can also set up aliases and functions. Add these commands to your profile, whose path is defined in the `$profile` variable. Learn more at the [About Profiles](https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_profiles) page on the Microsoft documentation site.
vi: Nếu bạn dùng Powershell trên Windows, bạn cũng có thể đặt các bí danh và chức năng tắt. Cho thêm các lệnh này vào prolfe của bạn, đường dẫn được định nghĩa ở biến `$profile`. Học thêm với trang [About Profiles](https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_profiles) tại trang tài liệu tham khảo của Microsoft .

source: # Other Resources
vi: # Tài nguyên khác

source: ## Books
vi: ## Sách

source: [Learn Enough Git to Be Dangerous](https://www.learnenough.com/git-tutorial) - A book by Michael Hartl covering Git from basics
vi: [Learn Enough Git to Be Dangerous](https://www.learnenough.com/git-tutorial) - Sách của Michael Hartl cho Git từ những điều cơ bản

source: [Pro Git](https://git-scm.com/book/en/v2) - Scott Chacon and Ben Straub's excellent book about Git
vi: [Pro Git](https://git-scm.com/book/en/v2) - Một cuốn sách xuất chúng của Scott Chacon và Ben Straub

source: [Git Internals](https://github.com/pluralsight/git-internals-pdf) - Scott Chacon's other excellent book about Git
vi: [Git Internals](https://github.com/pluralsight/git-internals-pdf) - Cuốn sách xuất chúng khác về Git của Scott Chacon

source: [Nasa handbook](https://www.nasa.gov/sites/default/files/atoms/files/nasa_systems_engineering_handbook.pdf)
vi: [Sổ tay NASA](https://www.nasa.gov/sites/default/files/atoms/files/nasa_systems_engineering_handbook.pdf)

source: ## Tutorials
vi: ## Hướng dẫn

source: [19 Git Tips For Everyday Use](https://www.alexkras.com/19-git-tips-for-everyday-use) - A list of useful Git one liners
vi: [19 mẹo sử dụng GIT hàng ngày](https://www.alexkras.com/19-git-tips-for-everyday-use) - Một danh sách các mẹo dùng GIT hữu ích.

source: [Atlassian's Git tutorial](https://www.atlassian.com/git/tutorials) Get Git right with tutorials from beginner to advanced.
vi: [Hướng dẫn Git của Atlassian](https://www.atlassian.com/git/tutorials) - Sử dụng Git đúng với các hướng dẫn từ cơ bản đến nâng cao.

source: [Learn Git branching](https://learngitbranching.js.org/) An interactive web based branching/merging/rebasing tutorial
vi: [Học về nhánh Git](https://learngitbranching.js.org/) - Hướng dẫn phân nhánh / merging / rebasing dựa trên web interactive

source: [Getting solid at Git rebase vs. merge](https://medium.com/@porteneuve/getting-solid-at-git-rebase-vs-merge-4fa1a48c53aa)
vi: [Chở nên vững chắc về Git rebase vs. merge](https://medium.com/@porteneuve/getting-solid-at-git-rebase-vs-merge-4fa1a48c53aa)

source: [Git Commands and Best Practices Cheat Sheet](https://zeroturnaround.com/rebellabs/git-commands-and-best-practices-cheat-sheet) - A Git cheat sheet in a blog post with more explanations
vi: [Tờ gian lận lệnh và thực hành tốt Git ](https://zeroturnaround.com/rebellabs/git-commands-and-best-practices-cheat-sheet) - Một Git cheat sheet trong một bài đăng trên blog với nhiều giải thích hơn

source: [Git from the inside out](https://codewords.recurse.com/issues/two/git-from-the-inside-out) - A tutorial that dives into Git's internals
vi: [Git từ trong ra ngoài](https://codewords.recurse.com/issues/two/git-from-the-inside-out) - Hướng dẫn đi sâu vào Git

source: [git-workflow](https://github.com/asmeurer/git-workflow) - [Aaron Meurer](https://github.com/asmeurer)'s howto on using Git to contribute to open source repositories
vi: [git-workflow](https://github.com/asmeurer/git-workflow) - [Aaron Meurer](https://github.com/asmeurer) viết cách sử dụng Git để đóng góp vào repository mã nguồn mở (open source)

source: [GitHub as a workflow](https://hugogiraudel.com/2015/08/13/github-as-a-workflow/) - An interesting take on using GitHub as a workflow, particularly with empty PRs
vi: [GitHub as a workflow](https://hugogiraudel.com/2015/08/13/github-as-a-workflow/) - Một ý kiến thú vị về sử dụng GitHub như một quy trình làm việc, đặc biệt với các PR trống.

source: [Githug](https://github.com/Gazler/githug) - A game to learn more common Git workflows
vi: [Githug](https://github.com/Gazler/githug) - Một trò chơi để học thêm về luồng làm việc thường thấy của Git.

source: [learnGitBranching](https://github.com/pcottle/learnGitBranching) - An interactive git visualization to challenge and educate!
vi: [learnGitBranching](https://github.com/pcottle/learnGitBranching) - Hình dung git có tương tác để thử thách và giáo dục!

source: ## Scripts and Tools
vi: ## Scripts (tập lệnh) và các công cụ

source: [firstaidgit.io](http://firstaidgit.io/) A searchable selection of the most frequently asked Git questions
vi: [firstaidgit.io](http://firstaidgit.io/) - Danh sách được lựa chọn có thể tìm kiếm các câu hỏi thường gặp về Git

source: [git-extra-commands](https://github.com/unixorn/git-extra-commands) - a collection of useful extra Git scripts
vi: [git-extra-commands](https://github.com/unixorn/git-extra-commands) - Tập hợp các script Git mở rộng hữu ích

source: [git-extras](https://github.com/tj/git-extras) - GIT utilities -- repo summary, repl, changelog population, author commit percentages and more
vi: [git-extras](https://github.com/tj/git-extras) - Các tiện ích GIT -- Repo tóm tắt, thay thế, số lượng thay đổi, tỷ lệ phần trăm của tác giả và nhiều nữa

source: [git-fire](https://github.com/qw3rtman/git-fire) - git-fire is a Git plugin that helps in the event of an emergency by adding all current files, committing, and pushing to a new branch (to prevent merge conflicts).
vi: [git-fire](https://github.com/qw3rtman/git-fire) - git-fire là một plugin cho Git để giúp trong trường hợp khẩn cấp bằng cách thêm tất cả các tệp hiện tại, commit và push vào một nhánh mới (để ngăn xung đột khi merge).

source: [git-tips](https://github.com/git-tips/tips) - Small Git tips
vi: [git-tips](https://github.com/git-tips/tips) - Các mẹo Git nhỏ

source: [git-town](https://github.com/Originate/git-town) - Generic, high-level Git workflow support! http://www.git-town.com
vi: [git-town](https://github.com/Originate/git-town) - Hỗ trợ luồng làm việc Git chung, tầm nâng cao! http://www.git-town.com

source: ## GUI Clients * [GitKraken](https://www.gitkraken.com/) - The downright luxurious Git client,for Windows, Mac & Linux * [git-cola](https://git-cola.github.io/) - another Git client for Windows and OS X * [GitUp](https://github.com/git-up/GitUp) - A newish GUI that has some very opinionated ways of dealing with Git's complications * [gitx-dev](https://rowanj.github.io/gitx/) - another graphical Git client for OS X * [Sourcetree](https://www.sourcetreeapp.com/) - Simplicity meets power in a beautiful and free Git GUI. For Windows and Mac. * [Tower](https://www.git-tower.com/) - graphical Git client for OS X (paid) * [tig](https://jonas.github.io/tig/) - terminal text-mode interface for Git * [Magit](https://magit.vc/) - Interface to Git implemented as an Emacs package. * [GitExtensions](https://github.com/gitextensions/gitextensions) - a shell extension, a Visual Studio 2010-2015 plugin and a standalone Git repository tool. * [Fork](https://git-fork.com/) - a fast and friendly Git client for Mac (beta) * [gmaster](https://gmaster.io/) - a Git client for Windows that has 3-way merge, analyze refactors, semantic diff and merge (beta) * [gitk](https://git-scm.com/docs/gitk) - a Git client for linux to allow simple view of repo state. * [SublimeMerge](https://www.sublimemerge.com/) - Blazing fast, extensible client that provides 3-way merges, powerful search and syntax highlighting, in active development.
vi: ## GUI Clients * [GitKraken](https://www.gitkraken.com/) - Client sang trọng cho Windows, Mac & Linux * [git-cola](https://git-cola.github.io/) - Git client khác cho Windows và OS X * [GitUp](https://github.com/git-up/GitUp) - Một GUI mới mẻ mà có một số cách rất quan tâm để giải quyết các việc khó chịu của Git * [gitx-dev](https://rowanj.github.io/gitx/) - Một Git client đồ hoạ khác cho OS X * [Sourcetree](https://www.sourcetreeapp.com/) - Sự đơn giản nhưng mạnh mẽ cho giao diện Git đẹp và miễn phí cho Windows và Mac. * [Tower](https://www.git-tower.com/) - Git client đồ hoạ cho OS X (trả phí) * [tig](https://jonas.github.io/tig/) - Terminal text-mode interface cho Git * [Magit](https://magit.vc/) - Interface cho Git thực hiện như một gói Emacs . * [GitExtensions](https://github.com/gitextensions/gitextensions) - Một shell extension, một Visual Studio 2010-2015 plugin và một công cụ Git repository độc lập. * [Fork](https://git-fork.com/) - Một Git client nhanh và thân thiện cho Mac (beta) * [gmaster](https://gmaster.io/) - Một Git client cho Windows với 3 cách merge, analyze refactors, semantic diff và merge (beta) * [gitk](https://git-scm.com/docs/gitk) - Một Git client cho Linux để cho phép xem đơn giản cho trạng thái repo. * [SublimeMerge](https://www.sublimemerge.com/) - Client nhanh, mở rộng, cung cấp 3 cách merge, tìm kiếm mạnh mẽ và làm nổi bật cú pháp, đang phát triển tích cực.
